{
  "works": [
    {
      "name": "Devo",
      "short_description": [
        "Cloud-native company offering real-time security analytics, machine learning, and scalable solutions for enterprise data management."
      ],
      "thumbnail": "devo1.png",
      "period_time": "March 2020 - March 2024",
      "full_description": [
        "Devo is a leading cloud-native logging and security analytics company dedicated to providing real-time insights and advanced analytics for enterprise data. Their robust platform empowers organizations to efficiently detect, analyze, and respond to security threats by leveraging the power of machine learning and a highly scalable architecture. Devo's solutions are designed to handle large volumes of data, ensuring that businesses can maintain high levels of performance and security. Serving a diverse range of industries, including finance and telecommunications, Devo enhances cybersecurity measures and optimizes data management practices, helping enterprises stay ahead of evolving threats and regulatory requirements. With a commitment to innovation and excellence, Devo is at the forefront of transforming how businesses approach security and data analytics."
      ],
      "contribution": [
        "At Devo, Israel played a crucial role in the data ingestion team, specifically focusing on the load balancer. Given the sensitivity of the data and its importance for diagnosing potential attacks, the service needed to be both reliable and fast. Under Israel's expertise, the system was able to handle an impressive ingestion volume of approximately 60TB per day. Additionally, he significantly contributed to Devo's efforts in adapting to the necessary standards for integration with U.S. federal systems, achieving FedRAMP certification. Furthermore, Israel participated in the creation of a multi-region and multi-cloud backup system, ensuring data redundancy and reliability across diverse environments. Israel's work ensured that Devo's platform met the highest levels of security and compliance, enhancing the company's capability to serve its clients effectively."
      ],
      "links": [
        {
          "tag": "Website",
          "url": "https://www.devo.com/es/",
          "text": "Devo Website"
        }
      ],
      "projects": [
        {
          "name": "Improve existant load balancer",
          "description": [
            "Israel contributed significantly to enhancing the performance of Devo's load balancer by implementing advanced strategies that improved fault tolerance and optimized the monitoring of data ingestion services. He meticulously analyzed the system's requirements and identified key areas for improvement, ensuring that the load balancer could handle varying levels of traffic with greater efficiency. His efforts in improving the fault tolerance mechanisms helped the system recover swiftly from unexpected failures, maintaining high availability and reliability. Additionally, Israel created support for the RELP (Reliable Event Logging Protocol) from scratch, ensuring reliable and efficient event logging across the system.",
            "Furthermore, Israel developed methods to balance the load based on the client, which facilitated more compact data queries. By ensuring that data was not unnecessarily mixed across all nodes, he streamlined the data retrieval process, making it faster and more efficient. This client-specific load balancing approach not only improved query performance but also reduced the overhead on the system. Israel's contributions led to a more robust and responsive load balancing system, significantly enhancing the overall performance and user experience at Devo."
          ],
          "links": [
            {
              "tag": "Documentation",
              "url": "https://docs.devo.com/space/latest/94653692/Event+load+balancers",
              "text": "Load balancer documentation"
            }
          ],
          "technologies": [
            "Node.js",
            "C",
            "C++",
            "FIPS",
            "FedRAMP",
            "SonarQube",
            "Snyk",
            "Owasp",
            "Jenkins",
            "Gitlab CI/CD",
            "Kubernetes",
            "Git",
            "Jira",
            "TDD",
            "BDD"
          ]
        }
      ],
      "images": [
        "devo1.png",
        "devo2.png"
      ]
    },
    {
      "name": "European Commission",
      "short_description": [
        "The European Commission is the executive branch of the European Union, responsible for proposing legislation, implementing decisions, and managing day-to-day affairs."
      ],
      "thumbnail": "European_Commission_01.png",
      "period_time": "June 2017 - January 2020",
      "full_description": [
        "The European Commission is the executive branch of the European Union, responsible for proposing legislation, implementing decisions, upholding the EU treaties, and managing the day-to-day business of the EU. It operates as a cabinet government, with 27 members of the Commission (one from each member state) led by a President. The Commission's main roles include developing strategies and policies, enforcing EU laws, and negotiating international agreements on behalf of the EU.",
        "Within the European Commission, the Directorate-General for Competition (DG COMP) plays a critical role. DG COMP is responsible for establishing and implementing competition policy to ensure fair competition within the EU internal market. This includes enforcing antitrust laws, overseeing mergers and acquisitions, and preventing monopolistic practices and state aid that could distort competition. DG COMP works to protect consumers and businesses by promoting innovation, ensuring a level playing field, and enhancing economic efficiency.",
        "Israel worked at DG COMP, contributing to the Commission's efforts to maintain competitive markets and foster economic growth across the European Union."
      ],
      "contribution": [
        "Israel worked as a software architect on three projects, with a wide range of responsibilities that showcased his expertise and leadership in software development. His key responsibilities included:",
        "<b>Management of Non-Functional Requirements and Project Definition</b>: Using Enterprise Architect, Israel was responsible for identifying and managing non-functional requirements, ensuring that each project was clearly defined and aligned with organizational goals.",
        "<b>Task Prioritization</b>: Utilizing Jira, he prioritized tasks effectively to ensure that the most critical elements were addressed in a timely manner.",
        "<b>Management of Task Dependencies</b>: He used Jira to manage dependencies between tasks, ensuring smooth progress and minimizing delays.",
        "<b>Technology Selection</b>: Israel was instrumental in selecting the appropriate technologies for each project, ensuring that they were well-suited to meet the project’s needs.",
        "<b>Team Member Profile Definition</b>: He defined the profiles and roles of team members, ensuring that the team had the necessary skills and expertise to succeed.",
        "<b>Inter-Team Collaboration</b>: Israel facilitated collaboration between different teams whose projects needed to be integrated, ensuring seamless integration and cooperation.",
        "<b>Quality Control and Testing</b>: He defined quality controls and testing protocols, including unit tests using technologies such as JUnit or Google Test/Valgrind, depending on the programming language.",
        "<b>CI/CD Systems Implementation</b>: He defined and implemented Continuous Integration and Continuous Deployment systems using tools like Bamboo and SonarQube.",
        "<b>Software Development Methodologies</b>: Israel applied Test-Driven Development (TDD) and Behavior-Driven Development (BDD) practices to ensure high-quality software development.",
        "<b>Agile Methodology</b>: He utilized SCRUM as the primary methodology for project management, fostering an agile and efficient development process."
      ],
      "links": [
        {
          "tag": "Website",
          "url": "https://competition-policy.ec.europa.eu/index_en",
          "text": "EU, DG COMP Website"
        }
      ],
      "projects": [
        {
          "name": "Definition of Two RESTful APIs",
          "description": [
            "The first project involved defining two RESTful APIs that implemented the Richardson Maturity Model Level 3, incorporating HATEOAS. These APIs were designed as platforms for the secure exchange of legal documents in anti-cartel proceedings.",
            "<b>Internal API</b>: The first API was intended to serve the internal staff of the European Commission.",
            "<b>External API</b>: The second API served as a platform for external personnel.",
            "Both APIs featured access control through a Single Sign-On system called CAS. Data persistence was managed using both Oracle DB and MongoDB. Additionally, the APIs were integrated with an internal secure document storage project via a SOAP interface. The workflow of each procedure was managed using the State design pattern, and system administrators were notified of status changes via email."
          ],
          "links": [
            {
              "tag": "Documentation",
              "url": "https://competition-policy.ec.europa.eu/document/download/2fc568de-61ff-4aaf-9c9b-e03e96324ef7_en?filename=eleniency_guidance_access-notification.pdf",
              "text": "e-leniency documentation"
            }
          ],
          "technologies": [
            "Java 8",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "Spring IoC",
            "JPA",
            "Eclipselink",
            "WebLogic 12",
            "Oracle DB",
            "MongoDB",
            "Swagger",
            "JUnit",
            "AngularJS 5",
            "Selenium",
            "Maven",
            "Git",
            "CAS",
            "Jira",
            "JUnit",
            "Bamboo",
            "SonarQube",
            "TDD",
            "BDD"
          ]
        }
      ],
      "images": [
        "European_Commission_02.png"
      ]
    }
  ],
  "educations": {
    "university": [
      {
        "university_name": "Alcalá de Henares University",
        "title": "Master's Degree in Artificial Intelligence in information and communication technologies",
        "period_time": "September 2007 - June 2009",
        "summary": [
          "Artificial intelligence and machine learning. Supervised, unsupervised and reinforced. Symbolic learning Classification and regression models. Optimization of models.",
          "Deep nets. Multilayer networks, backpropagation. Loss functions. Hyperparameters and learning strategies.",
          "Convolutional networks. Recognition of images.",
          "Sequential, recurrent networks. LSTM models.",
          "Paralleling and computation techniques in GPU-based architectures.",
          "Vectorization techniques. Programming with tensorflow and theano.",
          "Scalable automated learning. Parallelization frameworks in computer cluster.",
          "Applications in medicine, finance, automatic driving, etc."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      },
      {
        "university_name": "Alcalá de Henares University",
        "title": "Technical Engineering in Computer Science",
        "period_time": "September 2001 - June 2007",
        "summary": [
          "With honors in: Artificial Intelligence, Fuzzy Logic, Artificial Vision Systems, Physics II, Mathematical Analysis, Data Structure, Networks."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      }
    ],
    "complementary": [
      {
        "institution": "Linux Foundation",
        "title": "LPIC - 2",
        "period_time": "September 2015",
        "summary": [
          "Official certification of Linux system administration that implies the qualification for:",
          "Advanced administration of Linux systems, including those related to the kernel.",
          "Perform advanced management of storage of blocks and file system, as well asnetworks advanced authentication and system security, including firewall and VPN",
          "Install and configure core network services (DHCP, DNS, SSH, web servers, file servers, email, etc).",
          "Monitor assistants and advise management on automation and purchases"
        ],
        "images": [
          "linux_foundation.png"
        ],
        "thumbnail": "linux_foundation.png"
      },
      {
        "institution": "Linux Foundation",
        "title": "LPIC - 1",
        "period_time": "September 2013",
        "summary": [
          "Official certification of Linux system administration that implies the qualification for:",
          "Install a Linux system, including X11 and configure it as a network client.",
          "Work in command line.",
          "Manage files and access permissions including ACL, as well as system security.",
          "Perform simple maintenance tasks."
        ],
        "images": [
          "linux_foundation.png"
        ],
        "thumbnail": "linux_foundation.png"
      },
      {
        "institution": "Alcalá de Henares University",
        "title": "Design and evaluation of digital educational contents",
        "period_time": "September 2007",
        "summary": [
          "Design of educational content through the SCORM standard."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      },
      {
        "institution": "Alcalá de Henares University",
        "title": "Course of artificial vision",
        "period_time": "September 2007",
        "summary": [
          "Systems of artificial vision, convolutional matrices, filters."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      }
    ],
    "languages": [
      {
        "language": "Spanish",
        "spoken": "Native",
        "writen": "Native",
        "read": "Native",
        "acreditations": [],
        "thumbnail": "spanish.png"
      },
      {
        "language": "English",
        "spoken": "Fluent",
        "writen": "Fluent",
        "read": "Fluent",
        "acreditations": [],
        "thumbnail": "english.svg"
      },
      {
        "language": "Chinese",
        "spoken": "Fluent",
        "writen": "Fluent",
        "read": "Fluent",
        "acreditations": [
          {
            "institution": "Confucius Institute Madrid",
            "title": "HSK 3",
            "period_time": "September 2009"
          }
        ],
        "thumbnail": "chinese.png"
      }
    ]
  }
}
