{
  "works": [
    {
      "name": "Devo",
      "short_description": [
        "Cloud-native company offering real-time security analytics, machine learning, and scalable solutions for enterprise data management."
      ],
      "thumbnail": "devo.png",
      "period_time": "March 2020 - March 2024",
      "full_description": [
        "<P>Devo is a leading cloud-native logging and security analytics company dedicated to providing real-time insights and advanced analytics for enterprise data. Their robust platform empowers organizations to efficiently detect, analyze, and respond to security threats by leveraging the power of machine learning and a highly scalable architecture. Devo's solutions are designed to handle large volumes of data, ensuring that businesses can maintain high levels of performance and security. Serving a diverse range of industries, including finance and telecommunications, Devo enhances cybersecurity measures and optimizes data management practices, helping enterprises stay ahead of evolving threats and regulatory requirements. With a commitment to innovation and excellence, Devo is at the forefront of transforming how businesses approach security and data analytics.</P>"
      ],
      "contribution": [
        "<P>At Devo, Israel played a crucial role in the data ingestion team, specifically focusing on the load balancer. Given the sensitivity of the data and its importance for diagnosing potential attacks, the service needed to be both reliable and fast. Under Israel's expertise, the system was able to handle an impressive ingestion volume of approximately 60TB per day. Additionally, he significantly contributed to Devo's efforts in adapting to the necessary standards for integration with U.S. federal systems, achieving FedRAMP certification. Furthermore, Israel participated in the creation of a multi-region and multi-cloud backup system, ensuring data redundancy and reliability across diverse environments. Israel's work ensured that Devo's platform met the highest levels of security and compliance, enhancing the company's capability to serve its clients effectively.</P>"
      ],
      "links": [
        {
          "tag": "Website",
          "url": "https://www.devo.com/es/",
          "text": "Devo Website"
        }
      ],
      "projects": [
        {
          "name": "Improve existant load balancer",
          "description": [
            "<P>Israel contributed significantly to enhancing the performance of Devo's load balancer by implementing advanced strategies that improved fault tolerance and optimized the monitoring of data ingestion services. He meticulously analyzed the system's requirements and identified key areas for improvement, ensuring that the load balancer could handle varying levels of traffic with greater efficiency. His efforts in improving the fault tolerance mechanisms helped the system recover swiftly from unexpected failures, maintaining high availability and reliability. Additionally, Israel created support for the RELP (Reliable Event Logging Protocol) from scratch, ensuring reliable and efficient event logging across the system.</P>",
            "<P>Furthermore, Israel developed methods to balance the load based on the client, which facilitated more compact data queries. By ensuring that data was not unnecessarily mixed across all nodes, he streamlined the data retrieval process, making it faster and more efficient. This client-specific load balancing approach not only improved query performance but also reduced the overhead on the system. Israel's contributions led to a more robust and responsive load balancing system, significantly enhancing the overall performance and user experience at Devo.</P>"
          ],
          "links": [
            {
              "tag": "Documentation",
              "url": "https://docs.devo.com/space/latest/94653692/Event+load+balancers",
              "text": "Load balancer documentation"
            }
          ],
          "technologies": [
            "Node.js",
            "C",
            "C++",
            "FIPS",
            "FedRAMP",
            "SonarQube",
            "Snyk",
            "Owasp",
            "Jenkins",
            "Gitlab CI/CD",
            "Kubernetes",
            "Git",
            "Jira",
            "TDD",
            "BDD"
          ]
        },
        {
          "name": "Create a multi-cloud backup system",
          "description": [
            "<P>Israel spearheaded the development of a cutting-edge multi-cloud backup system from scratch, a crucial advancement for Devo's data redundancy and disaster recovery capabilities. This system was designed to store client logs across multiple regions and cloud environments, ensuring maximum data protection and availability. One of the key features of this system was its ability to configure storage types on-the-fly, allowing for seamless adjustments to the cloud storage configurations based on real-time needs and criteria.</P>",
            "<P>Israel implemented sophisticated data transition criteria, which automated the movement of data between various storage classes based on usage patterns and retention policies. This feature ensured that data was always stored in the most cost-effective and efficient manner, without compromising accessibility or performance.</P>",
            "<P>In addition to this, Israel's system included robust node recovery mechanisms, enabling quick restoration of service in the event of a node failure. This significantly reduced downtime and maintained the integrity and availability of critical data. To further enhance the system's efficiency, he developed advanced data compaction methods for data nearing its end-of-life, streamlining storage usage and reducing overhead.</P>",
            "<P>Finally, Israel integrated precise system cleanup schedules, ensuring that obsolete data was purged in a timely manner, maintaining optimal system performance and storage health. His contributions to this multi-cloud backup system not only fortified Devo's data management capabilities but also ensured compliance with stringent security and data retention regulations. This project underscored Israel's expertise in creating resilient, scalable, and highly efficient data storage solutions, reinforcing Devo's commitment to excellence in security and data analytics.</P>"
          ],
          "links": [],
          "technologies": [
            "Java 11",
            "Java 21",
            "AWS",
            "GCP",
            "FIPS",
            "FedRAMP",
            "SonarQube",
            "Snyk",
            "Owasp",
            "Jenkins",
            "Gitlab CI/CD",
            "Kubernetes",
            "Git",
            "Jira",
            "TDD",
            "BDD"
          ]
        },
        {
          "name": "Integrating Quality and Security Reviews into the CI/CD Pipeline",
          "description": [
            "<P>Israel played a pivotal role in the integration of comprehensive quality and security checks into Devo's CI/CD pipeline. This initiative was instrumental in elevating the development process to meet stringent industry standards, including NIST, FIPS, and FedRAMP.</P>",
            "<P><b>Jenkins Pipeline Integration</b></P>",
            "<P>Initially, Israel focused on incorporating SonarQube into the Jenkins pipeline for continuous code quality analysis. He configured SonarQube to perform static code analysis, which allowed the team to detect code smells, bugs, and potential vulnerabilities early in the development cycle. This integration ensured that only high-quality code was merged, significantly reducing the number of issues that reached production.</P>",
            "<P><b>Transition to GitLab CI/CD</b></P>",
            "<P>Following the success with Jenkins, Israel transitioned the pipeline to GitLab CI/CD. He leveraged GitLab's advanced features to streamline the process and enhance the automation of code deployments. This move facilitated better collaboration and efficiency across the development team.</P>",
            "<P><b>Security Vulnerability Scanning</b></P>",
            "<P>To address security vulnerabilities, Israel integrated Snyk and OWASP into the CI/CD pipeline. Snyk provided real-time scanning of open source dependencies, identifying and suggesting fixes for known vulnerabilities. Meanwhile, OWASP tools were utilized to perform comprehensive security assessments, focusing on identifying and mitigating risks associated with web applications.</P>",
            "<P><b>Achieving Compliance Standards</b></P>",
            "<P>Israel's meticulous work ensured that the pipeline adhered to the rigorous standards required by NIST, FIPS, and FedRAMP. He established automated checks and balances within the CI/CD process, ensuring that every code change underwent thorough quality and security reviews before deployment. This not only improved the overall security posture of the applications but also streamlined the compliance verification process, making it easier for Devo to demonstrate adherence to these critical standards.</P>",
            "<P><b>Outcome</b></P>",
            "<P>Israel's contributions significantly enhanced the robustness of Devo's CI/CD pipeline, ensuring that code quality and security were maintained at the highest levels. The integration of SonarQube, Snyk, and OWASP tools into the pipeline resulted in a more secure and efficient development process, aligning with the company’s commitment to innovation and excellence. This project was a crucial step in maintaining Devo's position at the forefront of cybersecurity and data analytics, providing clients with reliable and secure solutions.</P>"
          ],
          "links": [],
          "technologies": [
            "Gitlab CI/CD",
            "Jenkins",
            "NIST",
            "FIPS",
            "FedRAMP",
            "SonarQube",
            "Snyk",
            "Owasp",
            "Kubernetes",
            "Jira"
          ]
        },
        {
          "name": "Creation of an Alert System for Monitoring with Prometheus",
          "description": [
            "<P>Israel was instrumental in the development of a comprehensive alert system designed to monitor performance and critical situations in production environments using Prometheus. Recognizing the need for real-time monitoring and prompt response mechanisms, Israel architected a solution that provided detailed insights into system performance and detected potential issues such as fraud, attacks, and other anomalies.</P>",
            "<P>To achieve this, Israel integrated Prometheus into Devo's infrastructure, setting up robust metrics collection and alerting mechanisms. He defined key performance indicators (KPIs) and thresholds that were crucial for maintaining system health and stability. By leveraging Prometheus' powerful querying capabilities, Israel established a series of alert rules that could identify abnormal patterns in data ingestion, processing times, and system resource usage.</P>",
            "<P>In addition to setting up the alert system, Israel developed a thorough troubleshooting guide to assist the operations team in diagnosing and resolving issues swiftly. This guide included step-by-step procedures for identifying the root cause of alerts, recommended actions, and escalation protocols. The guide ensured that team members had a clear understanding of how to handle different types of alerts, from minor performance degradations to critical system failures.</P>",
            "<P>Furthermore, Israel implemented automated early response actions to mitigate potential issues before they escalated. These automated actions included restarting services, redistributing load, and scaling resources dynamically based on the nature and severity of the alerts. By automating these initial responses, Israel significantly reduced the mean time to recovery (MTTR) and minimized the impact of issues on the end-users.</P>",
            "<P>To enhance the overall effectiveness of the monitoring system, Israel also designed protocols for handling critical system situations. These protocols outlined the roles and responsibilities of team members, communication strategies, and coordination efforts required during major incidents. This structured approach ensured a swift and coordinated response, reducing downtime and maintaining service reliability.</P>",
            "<P>Israel's contributions to the creation of the alert system not only improved the monitoring capabilities of Devo's platform but also bolstered its security posture by enabling the early detection of fraud and attacks. His work ensured that the system could maintain high performance and resilience, providing Devo's clients with a reliable and secure data analytics platform.</P>"
          ],
          "links": [],
          "technologies": [
            "Prometheus",
            "Grafana",
            "kubernetes",
            "Docker",
            "Elastic Stack",
            "Kibana",
            "Python",
            "Bash",
            "Ansible",
            "Git"
          ]
        }
      ],
      "images": [
        "devo1.png",
        "devo2.png"
      ]
    },
    {
      "name": "European Commission",
      "short_description": [
        "The European Commission is the executive branch of the European Union, responsible for proposing legislation, implementing decisions, and managing day-to-day affairs."
      ],
      "thumbnail": "European_Commission_01.png",
      "period_time": "June 2017 - January 2020",
      "full_description": [
        "<P>The European Commission is the executive branch of the European Union, responsible for proposing legislation, implementing decisions, upholding the EU treaties, and managing the day-to-day business of the EU. It operates as a cabinet government, with 27 members of the Commission (one from each member state) led by a President. The Commission's main roles include developing strategies and policies, enforcing EU laws, and negotiating international agreements on behalf of the EU.</P>",
        "<P>Within the European Commission, the Directorate-General for Competition (DG COMP) plays a critical role. DG COMP is responsible for establishing and implementing competition policy to ensure fair competition within the EU internal market. This includes enforcing antitrust laws, overseeing mergers and acquisitions, and preventing monopolistic practices and state aid that could distort competition. DG COMP works to protect consumers and businesses by promoting innovation, ensuring a level playing field, and enhancing economic efficiency.</P>",
        "<P>Israel worked at DG COMP, contributing to the Commission's efforts to maintain competitive markets and foster economic growth across the European Union.</P>"
      ],
      "contribution": [
        "<P>Israel worked as a software architect on three projects, with a wide range of responsibilities that showcased his expertise and leadership in software development. His key responsibilities included:</P>",
        "<ul>",
        "<li><b>Management of Non-Functional Requirements and Project Definition</b>: Using Enterprise Architect, Israel was responsible for identifying and managing non-functional requirements, ensuring that each project was clearly defined and aligned with organizational goals.</li>",
        "<li><b>Task Prioritization</b>: Utilizing Jira, he prioritized tasks effectively to ensure that the most critical elements were addressed in a timely manner.</li>",
        "<li><b>Management of Task Dependencies</b>: He used Jira to manage dependencies between tasks, ensuring smooth progress and minimizing delays.</li>",
        "<li><b>Technology Selection</b>: Israel was instrumental in selecting the appropriate technologies for each project, ensuring that they were well-suited to meet the project’s needs.</li>",
        "<li><b>Team Member Profile Definition</b>: He defined the profiles and roles of team members, ensuring that the team had the necessary skills and expertise to succeed.</li>",
        "<li><b>Inter-Team Collaboration</b>: Israel facilitated collaboration between different teams whose projects needed to be integrated, ensuring seamless integration and cooperation.</li>",
        "<li><b>Quality Control and Testing</b>: He defined quality controls and testing protocols, including unit tests using technologies such as JUnit or Google Test/Valgrind, depending on the programming language.</li>",
        "<li><b>CI/CD Systems Implementation</b>: He defined and implemented Continuous Integration and Continuous Deployment systems using tools like Bamboo and SonarQube.</li>",
        "<li><b>Software Development Methodologies</b>: Israel applied Test-Driven Development (TDD) and Behavior-Driven Development (BDD) practices to ensure high-quality software development.</li>",
        "<li><b>Agile Methodology</b>: He utilized SCRUM as the primary methodology for project management, fostering an agile and efficient development process</li>.",
        "</ul>"
      ],
      "links": [
        {
          "tag": "Website",
          "url": "https://competition-policy.ec.europa.eu/index_en",
          "text": "EU, DG COMP Website"
        }
      ],
      "projects": [
        {
          "name": "Definition of Two RESTful APIs",
          "description": [
            "<P>The first project involved defining two RESTful APIs that implemented the Richardson Maturity Model Level 3, incorporating HATEOAS. These APIs were designed as platforms for the secure exchange of legal documents in anti-cartel proceedings.</P>",
            "<ul>",
            "<li><b>Internal API</b>: The first API was intended to serve the internal staff of the European Commission.</li>",
            "<li><b>External API</b>: The second API served as a platform for external personnel.</li>",
            "</ul>",
            "Both APIs featured access control through a Single Sign-On system called CAS. Data persistence was managed using both Oracle DB and MongoDB. Additionally, the APIs were integrated with an internal secure document storage project via a SOAP interface. The workflow of each procedure was managed using the State design pattern, and system administrators were notified of status changes via email."
          ],
          "links": [
            {
              "tag": "Documentation",
              "url": "https://competition-policy.ec.europa.eu/document/download/2fc568de-61ff-4aaf-9c9b-e03e96324ef7_en?filename=eleniency_guidance_access-notification.pdf",
              "text": "e-leniency documentation"
            }
          ],
          "technologies": [
            "Java 8",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "Spring IoC",
            "JPA",
            "Eclipselink",
            "WebLogic 12",
            "Oracle DB",
            "MongoDB",
            "Swagger",
            "JUnit",
            "AngularJS 5",
            "Selenium",
            "Maven",
            "Git",
            "CAS",
            "Jira",
            "JUnit",
            "Bamboo",
            "SonarQube",
            "TDD",
            "BDD"
          ]
        },
        {
          "name": "E-Confidenciality",
          "description": [
            "<P>In the second project, Israel played a pivotal role as the software architect, overseeing the development of a sophisticated system for negotiating confidential versions of legal documentation in anti-cartel proceedings. His contributions were instrumental in establishing and assigning dynamic verification groups responsible for managing online legal processes. These groups, composed of internal personnel, were verified through the Central Authentication Service (CAS), a system previously implemented under his guidance.</P>",
            "<P>Israel architected the system that governs the status of each document using the Status design pattern, which allows for the reversal of changes, ensuring the integrity and accuracy of legal documents throughout the negotiation process. His expertise ensured that any modifications could be undone, maintaining the documents' fidelity.</P>",
            "<P>Additionally, Israel selected and integrated Oracle DB and MongoDB as the database engines, capitalizing on their strengths to efficiently manage the project's complex data requirements. He ensured that the implementation followed the Richardson Maturity Model Level 3, incorporating HATEOAS (Hypermedia as the Engine of Application State) principles. This approach guaranteed a robust, scalable system capable of supporting the intricate workflows involved in anti-cartel legal proceedings.</P>",
            "<P>Through his leadership and technical expertise, Israel significantly enhanced the project's capability to provide a secure, reliable, and user-friendly platform for negotiating sensitive legal documents, thus bolstering the efficacy of anti-cartel enforcement actions. His work as the software architect was crucial in achieving the project's goals and ensuring its success.</P>"
          ],
          "links": [
            {
              "tag": "Documentation",
              "url": "https://competition-policy.ec.europa.eu/index/it-tools/econfidentiality_en",
              "text": "e-confidenciality documentation"
            }
          ],
          "technologies": [
            "AngularJS 5",
            "Ansible",
            "BDD",
            "Bamboo",
            "CAS",
            "Docker",
            "Eclipselink",
            "Enterprise Architect",
            "Git",
            "IntelliJ IDEA",
            "JPA",
            "JUnit",
            "Java 8",
            "Jira",
            "Maven",
            "MongoDB",
            "Oracle DB",
            "Selenium",
            "SonarQube",
            "Spring Data",
            "Spring Documentation",
            "Spring IoC",
            "Spring MVC",
            "Spring Security",
            "Swagger",
            "TDD",
            "WebLogic 12"
          ]
        },
        {
          "name": "Semantic index of legal documents",
          "description": [
            "<P>The third project, proposed by Israel, centers around developing a sophisticated system for semantic indexing of legal documents. Israel acted as the architect for this project, deeply involving himself in the programming process to ensure its success. The project utilizes clustering techniques, specifically the K-Means algorithm, applied to the dataset of legal documents from the anti-cartel department. The indexing process is integrated into a microservice designed with the gRPC framework, implemented in C++14 to ensure maximum efficiency and performance.</P>",
            "<P>The architecture of these microservices follows the Command Query Responsibility Segregation (CQRS) paradigm, deployed on a service pool to guarantee resilience and rapid response times. The semantic search capability is powered by a neural network trained on the anti-cartel legal documents dataset, utilizing the TensorFlow framework. Additionally, Israel developed a complementary service in Java, which leverages this semantic search tool to enhance its functionality.</P>",
            "<P>This dual-service approach not only facilitates high-speed semantic searches but also ensures robust and scalable indexing of complex legal documents. The system's design emphasizes resilience, efficiency, and accuracy, making it a vital tool for legal document management and retrieval in the anti-cartel department. Israel's initiative and hands-on involvement in both the architecture and programming were crucial to the project's success.</P>"
          ],
          "links": [],
          "technologies": [
            "AngularJS 5",
            "Ansible",
            "Bamboo",
            "C++",
            "CUDA",
            "Cassandra",
            "Docker",
            "Eclipselink",
            "Enterprise Architect",
            "GIT",
            "GoogleTest",
            "Groovy",
            "IntelliJ IDEA",
            "JPA",
            "JUnit",
            "Java 8",
            "Jira",
            "Maven",
            "Microservices",
            "OpenCL",
            "Oracle DB",
            "Selenium",
            "Sonarqube",
            "Spring Data",
            "Spring Documentation",
            "Spring MVC",
            "Spring Security",
            "Swagger",
            "TensorFlow",
            "Valgrind",
            "WebLogic 12",
            "gRPC"
          ]
        },
        {
          "name": "Development of a Renewable Energy Distribution System",
          "description": [
            "<P>The fourth project involves the development of a renewable energy distribution system within the electrical grid, aiming to normalize and stabilize electric consumption over time to maximize the utilization of renewable energies. Israel played a significant role in this project, contributing extensively to both its architecture and implementation.</P>",
            "<P>The system integrates a diverse array of technologies to achieve its goals. At the core of the communication system lies a Kafka-based messenger cluster, where communication with devices is managed through Avro schemas. An intermediary \"gateway\" is implemented using RaspberryPi, responsible for sending telemetry data and receiving commands. This gateway system is developed in Go, utilizing the ModBus communications protocol in both its serial and TCP versions, with TCP communications secured via a VPN.</P>",
            "<P>The software management for this project is handled through the BalenaIO platform, which facilitates the deployment and operation of the gateway devices. Continuous Integration and Continuous Deployment (CI/CD) processes are managed using CircleCI, ensuring a seamless and efficient development workflow.</P>",
            "<P>In addition, Israel created a statistics parser in Groovy for the ingestion of telemetry data, providing critical insights into energy consumption patterns and system performance. His involvement was pivotal, overseeing the architecture, implementation, and integration of various components to ensure the project's success.</P>",
            "<P>Israel's hands-on approach and technical expertise were instrumental in addressing the challenges of renewable energy distribution. His contribution in leveraging advanced technologies and developing robust communication protocols underscores his significant role in this innovative project aimed at enhancing the stability and efficiency of renewable energy usage within the electrical grid.</P>"
          ],
          "links": [],
          "technologies": [
            "Go",
            "Unit Test",
            "BalenaIO",
            "RaspberryPI",
            "Modbus",
            "Python",
            "Makefile",
            "Docker",
            "Kubernetes",
            "Google Cloud Computing",
            "Azure",
            "IoTHub",
            "Kafka",
            "Avro Schemas",
            "Ansible",
            "Elastic Search",
            "Kibanna",
            "Makefile",
            "Jira",
            "Groovy"
          ]
        }
      ],
      "images": [
        "European_Commission_02.png"
      ]
    },
    {
      "name": "Panel Systems",
      "short_description": [
        "Panel Sistemas is a company specializing in technological solutions, offering software services, consulting, and development to various industries."
      ],
      "thumbnail": "panel_sistemas.png",
      "period_time": "September 2015 - June 2017",
      "full_description": [
        "<P>Panel Sistemas is a leading technology solutions company specializing in software development, consulting, and IT services. Founded in Spain, it serves diverse industries with notable clients such as Telefónica, BBVA, Santander, Repsol, and El Corte Inglés.</P>",
        "<b>Services Offered</b>",
        "<lu>",
        "<li>Software Development: Custom software solutions.</li>",
        "<li>Consulting: IT strategy and optimization.</li>",
        "<li>Maintenance and Support: Ongoing application support.</li>",
        "<li>Quality Assurance: Comprehensive software testing.</li>",
        "<li>Digital Transformation: Transitioning businesses to digital platforms.</li>",
        "</lu>",
        "<b>Industry Expertise</b>",
        "<lu>",
        "<li>Finance</li>",
        "<li>Telecommunications</li>",
        "<li>Energy</li>",
        "<li>Retail</li>",
        "</lu>"
      ],
      "contribution": [
        "<P>Israel has worked as a functional analyst on three projects. In addition, he has performed tasks as a senior programmer in the post-decision-making phase. His responsibilities as a functional analyst have included the following:</P>",
        "<ul>",
        "<li>Analysis of non-functional requirements and decision-making on the exact implementation of the solution (Redmine)</li>",
        "<li>Creation of sub-tasks with lower granularity to achieve objectives (Redmine)</li>",
        "<li>Time estimation (Redmine)</li>",
        "<li>Definition and implementation of the project structure in the specified technologies</li>",
        "<li>Definition of unit test coverage and quality (JUnit, Google Test, Valgrind)</li>",
        "<li>Implementation of CI/CD systems (Jenkins)</li>",
        "<li>Utilization of SCRUM as the development methodology</li>",
        "<li>Application of TDD and BDD in software development</li>",
        "<li>Delivery of training sessions on TDD, BDD, Neural Networks, Clean Code, and more</li>",
        "</ul>"
      ],
      "links": [
        {
          "tag": "Website",
          "url": "https://competition-policy.ec.europa.eu/index_en",
          "text": "EU, DG COMP Website"
        }
      ],
      "projects": [
        {
          "name": "Definition of Two RESTful APIs",
          "description": [
            "<P>The first of the projects I worked on involved implementing a message exchange platform for maritime and air transport. This project successfully replaced the outdated IATA standard, which was based on plain text and prone to human errors due to its reliance on the position of the text string, with a more modern, readable, and error-resistant format based on XML/JSON.</P>",
            "<P>To achieve this, I defined a parser that translated messages from the old format to either of the two modern standards through a Restful API that adhered to the Richardson Level 3 maturity model. This API not only provided an entry point for message translation but also facilitated intercommunication with other platforms worldwide and the storage of these communications to ensure the traceability of package transit globally. The project's goals required a high-availability structure and a replicated database system based on MongoDB, implemented through a cluster of servers with each shard replicated.</P>"
          ],
          "links": [
            {
              "tag": "Documentation",
              "url": "https://competition-policy.ec.europa.eu/document/download/2fc568de-61ff-4aaf-9c9b-e03e96324ef7_en?filename=eleniency_guidance_access-notification.pdf",
              "text": "e-leniency documentation"
            }
          ],
          "technologies": [
            "Java 8",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "Spring IoC",
            "JPA",
            "Eclipselink",
            "WebLogic 12",
            "Oracle DB",
            "MongoDB",
            "Swagger",
            "JUnit",
            "AngularJS 5",
            "Selenium",
            "Maven",
            "Git",
            "CAS",
            "Jira",
            "JUnit",
            "Bamboo",
            "SonarQube",
            "TDD",
            "BDD"
          ]
        },
        {
          "name": "E-Confidenciality",
          "description": [
            "In the second project, Israel played a pivotal role as the software architect, overseeing the development of a sophisticated system for negotiating confidential versions of legal documentation in anti-cartel proceedings. His contributions were instrumental in establishing and assigning dynamic verification groups responsible for managing online legal processes. These groups, composed of internal personnel, were verified through the Central Authentication Service (CAS), a system previously implemented under his guidance.",
            "Israel architected the system that governs the status of each document using the Status design pattern, which allows for the reversal of changes, ensuring the integrity and accuracy of legal documents throughout the negotiation process. His expertise ensured that any modifications could be undone, maintaining the documents' fidelity.",
            "Additionally, Israel selected and integrated Oracle DB and MongoDB as the database engines, capitalizing on their strengths to efficiently manage the project's complex data requirements. He ensured that the implementation followed the Richardson Maturity Model Level 3, incorporating HATEOAS (Hypermedia as the Engine of Application State) principles. This approach guaranteed a robust, scalable system capable of supporting the intricate workflows involved in anti-cartel legal proceedings.",
            "Through his leadership and technical expertise, Israel significantly enhanced the project's capability to provide a secure, reliable, and user-friendly platform for negotiating sensitive legal documents, thus bolstering the efficacy of anti-cartel enforcement actions. His work as the software architect was crucial in achieving the project's goals and ensuring its success."
          ],
          "links": [
            {
              "tag": "Documentation",
              "url": "https://competition-policy.ec.europa.eu/index/it-tools/econfidentiality_en",
              "text": "e-confidenciality documentation"
            }
          ],
          "technologies": [
            "AngularJS 5",
            "Ansible",
            "BDD",
            "Bamboo",
            "CAS",
            "Docker",
            "Eclipselink",
            "Enterprise Architect",
            "Git",
            "IntelliJ IDEA",
            "JPA",
            "JUnit",
            "Java 8",
            "Jira",
            "Maven",
            "MongoDB",
            "Oracle DB",
            "Selenium",
            "SonarQube",
            "Spring Data",
            "Spring Documentation",
            "Spring IoC",
            "Spring MVC",
            "Spring Security",
            "Swagger",
            "TDD",
            "WebLogic 12"
          ]
        },
        {
          "name": "Semantic index of legal documents",
          "description": [
            "The third project, proposed by Israel, centers around developing a sophisticated system for semantic indexing of legal documents. Israel acted as the architect for this project, deeply involving himself in the programming process to ensure its success. The project utilizes clustering techniques, specifically the K-Means algorithm, applied to the dataset of legal documents from the anti-cartel department. The indexing process is integrated into a microservice designed with the gRPC framework, implemented in C++14 to ensure maximum efficiency and performance.",
            "The architecture of these microservices follows the Command Query Responsibility Segregation (CQRS) paradigm, deployed on a service pool to guarantee resilience and rapid response times. The semantic search capability is powered by a neural network trained on the anti-cartel legal documents dataset, utilizing the TensorFlow framework. Additionally, Israel developed a complementary service in Java, which leverages this semantic search tool to enhance its functionality.",
            "This dual-service approach not only facilitates high-speed semantic searches but also ensures robust and scalable indexing of complex legal documents. The system's design emphasizes resilience, efficiency, and accuracy, making it a vital tool for legal document management and retrieval in the anti-cartel department. Israel's initiative and hands-on involvement in both the architecture and programming were crucial to the project's success."
          ],
          "links": [],
          "technologies": [
            "AngularJS 5",
            "Ansible",
            "Bamboo",
            "C++",
            "CUDA",
            "Cassandra",
            "Docker",
            "Eclipselink",
            "Enterprise Architect",
            "GIT",
            "GoogleTest",
            "Groovy",
            "IntelliJ IDEA",
            "JPA",
            "JUnit",
            "Java 8",
            "Jira",
            "Maven",
            "Microservices",
            "OpenCL",
            "Oracle DB",
            "Selenium",
            "Sonarqube",
            "Spring Data",
            "Spring Documentation",
            "Spring MVC",
            "Spring Security",
            "Swagger",
            "TensorFlow",
            "Valgrind",
            "WebLogic 12",
            "gRPC"
          ]
        },
        {
          "name": "Development of a Renewable Energy Distribution System",
          "description": [
            "The fourth project involves the development of a renewable energy distribution system within the electrical grid, aiming to normalize and stabilize electric consumption over time to maximize the utilization of renewable energies. Israel played a significant role in this project, contributing extensively to both its architecture and implementation.",
            "The system integrates a diverse array of technologies to achieve its goals. At the core of the communication system lies a Kafka-based messenger cluster, where communication with devices is managed through Avro schemas. An intermediary \"gateway\" is implemented using RaspberryPi, responsible for sending telemetry data and receiving commands. This gateway system is developed in Go, utilizing the ModBus communications protocol in both its serial and TCP versions, with TCP communications secured via a VPN.",
            "The software management for this project is handled through the BalenaIO platform, which facilitates the deployment and operation of the gateway devices. Continuous Integration and Continuous Deployment (CI/CD) processes are managed using CircleCI, ensuring a seamless and efficient development workflow.",
            "In addition, Israel created a statistics parser in Groovy for the ingestion of telemetry data, providing critical insights into energy consumption patterns and system performance. His involvement was pivotal, overseeing the architecture, implementation, and integration of various components to ensure the project's success.",
            "Israel's hands-on approach and technical expertise were instrumental in addressing the challenges of renewable energy distribution. His contribution in leveraging advanced technologies and developing robust communication protocols underscores his significant role in this innovative project aimed at enhancing the stability and efficiency of renewable energy usage within the electrical grid."
          ],
          "links": [],
          "technologies": [
            "Go",
            "Unit Test",
            "BalenaIO",
            "RaspberryPI",
            "Modbus",
            "Python",
            "Makefile",
            "Docker",
            "Kubernetes",
            "Google Cloud Computing",
            "Azure",
            "IoTHub",
            "Kafka",
            "Avro Schemas",
            "Ansible",
            "Elastic Search",
            "Kibanna",
            "Makefile",
            "Jira",
            "Groovy"
          ]
        }
      ],
      "images": [
        "European_Commission_02.png"
      ]
    }
  ],
  "educations": {
    "university": [
      {
        "university_name": "Alcalá de Henares University",
        "title": "Master's Degree in Artificial Intelligence in information and communication technologies",
        "period_time": "September 2007 - June 2009",
        "summary": [
          "Artificial intelligence and machine learning. Supervised, unsupervised and reinforced. Symbolic learning Classification and regression models. Optimization of models.",
          "Deep nets. Multilayer networks, backpropagation. Loss functions. Hyperparameters and learning strategies.",
          "Convolutional networks. Recognition of images.",
          "Sequential, recurrent networks. LSTM models.",
          "Paralleling and computation techniques in GPU-based architectures.",
          "Vectorization techniques. Programming with tensorflow and theano.",
          "Scalable automated learning. Parallelization frameworks in computer cluster.",
          "Applications in medicine, finance, automatic driving, etc."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      },
      {
        "university_name": "Alcalá de Henares University",
        "title": "Technical Engineering in Computer Science",
        "period_time": "September 2001 - June 2007",
        "summary": [
          "With honors in: Artificial Intelligence, Fuzzy Logic, Artificial Vision Systems, Physics II, Mathematical Analysis, Data Structure, Networks."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      }
    ],
    "complementary": [
      {
        "institution": "Linux Foundation",
        "title": "LPIC - 2",
        "period_time": "September 2015",
        "summary": [
          "Official certification of Linux system administration that implies the qualification for:",
          "Advanced administration of Linux systems, including those related to the kernel.",
          "Perform advanced management of storage of blocks and file system, as well asnetworks advanced authentication and system security, including firewall and VPN",
          "Install and configure core network services (DHCP, DNS, SSH, web servers, file servers, email, etc).",
          "Monitor assistants and advise management on automation and purchases"
        ],
        "images": [
          "linux_foundation.png"
        ],
        "thumbnail": "linux_foundation.png"
      },
      {
        "institution": "Linux Foundation",
        "title": "LPIC - 1",
        "period_time": "September 2013",
        "summary": [
          "Official certification of Linux system administration that implies the qualification for:",
          "Install a Linux system, including X11 and configure it as a network client.",
          "Work in command line.",
          "Manage files and access permissions including ACL, as well as system security.",
          "Perform simple maintenance tasks."
        ],
        "images": [
          "linux_foundation.png"
        ],
        "thumbnail": "linux_foundation.png"
      },
      {
        "institution": "Alcalá de Henares University",
        "title": "Design and evaluation of digital educational contents",
        "period_time": "September 2007",
        "summary": [
          "Design of educational content through the SCORM standard."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      },
      {
        "institution": "Alcalá de Henares University",
        "title": "Course of artificial vision",
        "period_time": "September 2007",
        "summary": [
          "Systems of artificial vision, convolutional matrices, filters."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      }
    ],
    "languages": [
      {
        "language": "Spanish",
        "spoken": "Native",
        "writen": "Native",
        "read": "Native",
        "acreditations": [],
        "thumbnail": "spanish.png"
      },
      {
        "language": "English",
        "spoken": "Fluent",
        "writen": "Fluent",
        "read": "Fluent",
        "acreditations": [],
        "thumbnail": "english.svg"
      },
      {
        "language": "Chinese",
        "spoken": "Fluent",
        "writen": "Fluent",
        "read": "Fluent",
        "acreditations": [
          {
            "institution": "Confucius Institute Madrid",
            "title": "HSK 3",
            "period_time": "September 2009"
          }
        ],
        "thumbnail": "chinese.png"
      }
    ]
  }
}
