{
  "intro": {
    "greeting": "¡Hola! Soy Israel, un dev senior empedernido viajando por el mundo.",
    "profile_image": "israel.png",
    "name": "Israel López",
    "title": "Ingeniero de Software Senior",
    "summary": "<p>Mi mochila está llena de código y de ganas de seguir aprendiendo. ¡La programación es mi superpoder! Me considero una mente inquieta por las ganas insaciables que tengo de aprender,  innovar y superar nuevos retos intelectuales. Tengo la suerte de que la programación no solo es mi trabajo, también es mi pasión y si hay algo que me caracteriza es mi insistencia por encontrar la solución óptima al proyecto.</p>",
    "links": [
      {
        "text": "@israellopezdeveloper",
        "url": "https://github.com/israellopezdeveloper",
        "icon": ""
      },
      {
        "text": "israel.lopez.developer@gmail.com",
        "url": "mailto:israel.lopez.developer@gmail.com",
        "icon": "󰇮"
      },
      {
        "text": "https://www.linkedin.com/in/israellopezmaiz/",
        "url": "https://www.linkedin.com/in/israellopezmaiz/",
        "icon": "󰌻"
      },
      {
        "text": "+34 648 13 66 40",
        "url": "tel:+34648136640",
        "icon": ""
      }
    ],
    "hobbies": "<p>🧗 escalada, 🏂 snowboard, 🧭 viajar, 🤿 buceo, ⨋ matemáticas (especialmente álgebra lineal y estadísticas), 🧠 Inteligencia Artificial.</p>",
    "bio": [
      {
        "dates": "1983",
        "text": "Nací en Madrid, España"
      },
      {
        "dates": "2007",
        "text": "Complete la licenciatura en Informática en la Universidad de Alcalá de Henares"
      },
      {
        "dates": "2009",
        "text": "Complete el Master en Inteligencia Artificila en información y comunicación de tecnologias en la Universidad de Alcalá de Henares."
      },
      {
        "dates": "2004 a la actualidad",
        "text": "Trabajando como empleado"
      }
    ]
  },
  "works": [
    {
      "name": "Datura AI",
      "short_description": "<p>Su misión consiste en construir soluciones que superen los sistemas centralizados, ofreciendo\n    herramientas de fácil uso y gran rendimiento. Entre sus productos se encuentra Celium , una plataforma para despliegue instantáneo de modelos de IA en containers,\n    que habilita edición de pods, plantillas de despliegue y ejecución rápida de modelos como Stable Diffusion o Whisper.</p>",
      "thumbnail": "daturaai.png",
      "period_time": {
        "start": "Marzo 2025",
        "end": "",
        "current": true
      },
      "full_description": "<p>Datura AI es una compañía especializada en el desarrollo de tecnologías para la distribución y ejecución de modelos de Inteligencia Artificial en redes descentralizadas y entornos distribuidos. Su objetivo es eliminar las limitaciones de los sistemas centralizados, ofreciendo herramientas que permitan desplegar modelos de IA de forma segura, rápida y escalable, tanto en la nube como en dispositivos remotos. Su producto principal, Celium , es una plataforma para la orquestación y gestión de modelos de IA en contenedores. Permite: Desplegar modelos de forma instantánea en entornos distribuidos o en el edge.</p>",
      "contribution": "<p>Optimización del ciclo de despliegue de modelos en entornos distribuidos, reduciendo tiempos de puesta en producción. Implementación de módulos en Python y Rust para gestión de modelos, monitorización y recuperación ante fallos. Optimización del uso de GPU y CPU para maximizar eficiencia energética.</p>",
      "links": [
        {
          "text": "Website",
          "url": "https://www.datura.ai"
        }
      ],
      "projects": [
        {
          "name": "Plataforma para la orquestación y distribución de modelos de IA en entornos distribuidos",
          "description": "<p>Celium es una plataforma desarrollada por Datura AI para gestionar, desplegar y optimizar modelos de Inteligencia Artificial en redes distribuidas y dispositivos remotos. Su objetivo es facilitar la ejecución de modelos complejos, como Stable Diffusion, Whisper, LLaMA o Mistral, incluso en entornos con recursos limitados, garantizando alta disponibilidad, escalabilidad y rendimiento. La plataforma permite a los usuarios: Desplegar modelos de forma instantánea en contenedores sobre infraestructuras locales, en la nube o en el edge. Celium utiliza una arquitectura modular basada en contenedores y orquestadores, optimizada para reducir la latencia y el consumo de recursos. Emplea balanceo de cargas inteligente, gestión distribuida de datos y técnicas avanzadas de afinidad de procesos para maximizar la eficiencia energética y el rendimiento del hardware disponible.</p>",
          "technologies": [
            "Python",
            "Rust",
            "C",
            "Docker",
            "Kubernetes",
            "Helm",
            "Git",
            "GitHub Actions",
            "GPU Computing",
            "CUDA",
            "Tech",
            "Bittensor",
            "Prometheus"
          ],
          "links": [
            {
              "text": "Portal de Celium",
              "url": "https://lium.io/"
            }
          ],
          "images": []
        }
      ],
      "images": []
    },
    {
      "name": "Indra",
      "short_description": "Indra es una multinacional española líder en consultoría y tecnología, con presencia en más de 140 países. En el ámbito de Defensa, desarrolla sistemas estratégicos y de misión crítica que fortalecen la autonomía tecnológica y la interoperabilidad de las fuerzas armadas de Europa y países aliados de la OTAN.",
      "thumbnail": "indra.png",
      "period_time": {
        "start": "Abril 2024",
        "end": "Febrero 2025",
        "current": false
      },
      "full_description": "<p>En el ámbito de Defensa, Indra lidera el desarrollo del primer sistema de misión de nueva generación para vehículos militares de Europa y países de la OTAN, un proyecto pionero que busca proporcionar a las fuerzas armadas una plataforma abierta, modular y escalable que integre sensores, sistemas de comunicación, capacidades de Inteligencia Artificial y componentes GIS para optimizar la toma de decisiones en entornos operativos complejos. Trabajé en este proyecto como Senior Software Engineer, contribuyendo a la definición, desarrollo e integración de componentes críticos en un ecosistema tecnológico que combinaba Java, Node.js, Python, sistemas de Recuperación Aumentada de Información (RAG) y GIS.</p>",
      "contribution": "<p>En Indra participé en las siguientes áreas clave: Diseño e implementación backend en Java y Node.js con principios de Clean Architecture para lograr mantenibilidad y escalabilidad. Integración de un sistema RAG para recuperación contextual de inteligencia operativa: ingesta heterogénea, embeddings y búsqueda semántica. Capacidades GIS para análisis geoespacial, visualización táctica y optimización de rutas/despliegues en tiempo real. Definición de APIs e interfaces para interoperar con sistemas OTAN, cumpliendo estándares y protocolos seguros.</p>",
      "links": [],
      "projects": [
        {
          "name": "Sistema de misión de nueva generación para vehículos militares",
          "description": "<p>Proyecto estratégico desarrollado por Indra en el marco del Fondo Europeo de Defensa para crear el primer sistema de misión de nueva generación para vehículos militares de Europa y países de la OTAN . El sistema integra capacidades de Inteligencia Artificial, GIS y gestión de sensores para ofrecer a las\n    fuerzas armadas una ventaja táctica en entornos operativos complejos. La arquitectura es abierta, modular y escalable, permitiendo la interoperabilidad entre ejércitos aliados\n    y la rápida integración de nuevos componentes tecnológicos. Incluye un sistema RAG para\n    recuperación contextual de información, análisis geoespacial en tiempo real, y módulos de comunicación\n    seguros para la transmisión de datos críticos. Desarrollo e integración de un sistema RAG para búsqueda semántica y contextualización de datos operativos.</p>",
          "technologies": [
            "Java",
            "Spring Boot",
            "Spring Data",
            "Spring Security",
            "Node.js",
            "Express",
            "Python",
            "FastAPI",
            "RAG",
            "Vector DB",
            "Embeddings",
            "PostgreSQL",
            "MongoDB",
            "GIS",
            "PostGIS",
            "OpenLayers",
            "Docker",
            "Kubernetes",
            "Helm",
            "GitHub Actions",
            "Jira",
            "Prometheus",
            "Grafana"
          ],
          "links": [
            {
              "text": "Participación de Indra en el Fondo Europeo de Defensa",
              "url": "https://www.indracompany.com/es/noticia/indra-lidera-participacion-espanola-proyectos-fondo-europeo-defensa-entra-formar-12"
            }
          ],
          "images": []
        }
      ],
      "images": []
    },
    {
      "name": "Devo",
      "short_description": "Empresa nativa de la nube que ofrece análisis de seguridad en tiempo real, aprendizaje automático y soluciones escalables para la gestión de datos empresariales.",
      "thumbnail": "devo.png",
      "period_time": {
        "start": "Marzo 2020",
        "end": "Marzo 2024",
        "current": false
      },
      "full_description": "<p>Devo es una empresa líder en análisis de registros y seguridad nativa en la nube, dedicada a proporcionar conocimientos en tiempo real y análisis avanzados para datos empresariales. Sirviendo a una amplia gama de industrias, incluidas finanzas y telecomunicaciones, Devo mejora las medidas de ciberseguridad y optimiza las prácticas de gestión de datos, ayudando a las empresas a mantenerse por delante de las amenazas y requisitos regulatorios en evolución.</p>",
      "contribution": "<p>En Devo, desempeñé un papel crucial en el equipo de ingesta de datos, centrándome específicamente en el balanceador de carga. Además, contribuí significativamente a los esfuerzos de Devo para adaptarse a los estándares necesarios para la integración con sistemas federales de EE.UU., logrando la certificación FedRAMP. Mi trabajo garantizó que la plataforma de Devo cumpliera con los más altos niveles de seguridad y cumplimiento, mejorando la capacidad de la empresa para servir eficazmente a sus clientes.</p>",
      "links": [
        {
          "text": "Sitio web de Devo",
          "url": "https://www.devo.com/es/"
        }
      ],
      "projects": [
        {
          "name": "Mejorar el balanceador de carga existente",
          "description": "<p>Contribuí significativamente a mejorar el rendimiento del balanceador de carga de Devo mediante la implementación de estrategias avanzadas que mejoraron la tolerancia a fallos y optimizaron la monitorización de los servicios de ingesta de datos. Analicé meticulosamente los requisitos del sistema e identifiqué áreas clave de mejora, asegurando que el balanceador de carga pudiera manejar niveles variables de tráfico con mayor eficiencia. Mis esfuerzos en mejorar los mecanismos de tolerancia a fallos ayudaron al sistema a recuperarse rápidamente de fallos inesperados, manteniendo alta disponibilidad y fiabilidad. Mis contribuciones llevaron a un sistema de balanceo de carga más robusto y receptivo, mejorando significativamente el rendimiento y la experiencia del usuario en Devo.</p>",
          "technologies": [
            "Node.js",
            "C",
            "C++",
            "FIPS",
            "FedRAMP",
            "SonarQube",
            "Snyk",
            "Owasp",
            "Jenkins",
            "Gitlab CI/CD",
            "Kubernetes",
            "GIT",
            "Jira",
            "TDD",
            "BDD"
          ],
          "links": [
            {
              "text": "Documentación del balanceador de carga",
              "url": "https://docs.devo.com/space/latest/94653692/Event+load+balancers"
            }
          ],
          "images": []
        },
        {
          "name": "Crear un sistema de respaldo multicloud",
          "description": "<p>Este sistema fue diseñado para almacenar registros de clientes en múltiples regiones y entornos en la nube, asegurando la máxima protección y disponibilidad de los datos. Una de las características clave de este sistema fue su capacidad para configurar tipos de almacenamiento en tiempo real, permitiendo ajustes fluidos a las configuraciones de almacenamiento en la nube basados en necesidades y criterios en tiempo real. Implementé criterios sofisticados de transición de datos, que automatizaron el movimiento de datos entre diversas clases de almacenamiento basándose en patrones de uso y políticas de retención. Para mejorar aún más la eficiencia del sistema, desarrollé métodos avanzados de compactación de datos para los datos que estaban cerca del final de su vida útil, optimizando el uso del almacenamiento y reduciendo la sobrecarga. Mis contribuciones a este sistema de respaldo multicloud no solo fortalecieron las capacidades de gestión de datos de Devo sino que también garantizaron el cumplimiento de estrictas regulaciones de seguridad y retención de datos. Este proyecto destacó mi experiencia en la creación de soluciones de almacenamiento de datos resilientes, escalables y altamente eficientes, reforzando el compromiso de Devo con la excelencia en seguridad y análisis de datos.</p>",
          "technologies": [
            "Java",
            "AWS",
            "GCP",
            "FIPS",
            "FedRAMP",
            "SonarQube",
            "Snyk",
            "Owasp",
            "Jenkins",
            "Gitlab CI/CD",
            "Kubernetes",
            "GIT",
            "Jira",
            "TDD",
            "BDD"
          ],
          "links": [],
          "images": []
        },
        {
          "name": "Integrar revisiones de calidad y seguridad en el pipeline CI/CD",
          "description": "<p>Jugué un papel fundamental en la integración de revisiones comprensivas de calidad y seguridad en el pipeline CI/CD de Devo. Integración del Pipeline Jenkins Inicialmente, me centré en incorporar SonarQube en el pipeline Jenkins para el análisis continuo de calidad del código. Configuré SonarQube para realizar análisis estático del código, lo que permitió al equipo detectar olores de código, errores y posibles vulnerabilidades temprano en el ciclo de desarrollo. Esta integración aseguró que solo se fusionara código de alta calidad, reduciendo significativamente la cantidad de problemas que llegaban a producción. Transición a GitLab CI/CD Tras el éxito con Jenkins, hice la transición del pipeline a GitLab CI/CD. Escaneo de Vulnerabilidades de Seguridad Para abordar las vulnerabilidades de seguridad, integré Snyk y OWASP en el pipeline CI/CD. Establecí verificaciones y balances automatizados dentro del proceso CI/CD, garantizando que cada cambio de código pasara por revisiones exhaustivas de calidad y seguridad antes de su implementación. Resultado Mis contribuciones mejoraron significativamente la robustez del pipeline CI/CD de Devo, asegurando que la calidad y seguridad del código se mantuvieran en los más altos niveles.</p>",
          "technologies": [
            "Gitlab CI/CD",
            "Jenkins",
            "NIST",
            "FIPS",
            "FedRAMP",
            "SonarQube",
            "Snyk",
            "Owasp",
            "Kubernetes",
            "Jira"
          ],
          "links": [],
          "images": []
        },
        {
          "name": "Creación de un sistema de alerta para monitoreo con Prometheus",
          "description": "<p>Fui fundamental en el desarrollo de un sistema de alerta integral diseñado para monitorear el rendimiento y situaciones críticas en entornos de producción utilizando Prometheus. Reconociendo la necesidad de monitoreo en tiempo real y mecanismos de respuesta rápida, diseñé una solución que proporcionaba conocimientos detallados sobre el rendimiento del sistema y detectaba posibles problemas como fraudes, ataques y otras anomalías. Definí indicadores clave de rendimiento (KPIs) y umbrales cruciales para mantener la salud y estabilidad del sistema. Aprovechando las potentes capacidades de consulta de Prometheus, establecí una serie de reglas de alerta que podían identificar patrones anormales en la ingesta de datos, tiempos de procesamiento y uso de recursos del sistema. Además de configurar el sistema de alerta, desarrollé una guía completa de solución de problemas para asistir al equipo de operaciones en el diagnóstico y resolución de problemas rápidamente. La guía aseguraba que los miembros del equipo tuvieran una comprensión clara de cómo manejar diferentes tipos de alertas, desde degradaciones menores del rendimiento hasta fallas críticas del sistema. Para mejorar la efectividad general del sistema de monitoreo, también diseñé protocolos para manejar situaciones críticas del sistema. Mis contribuciones a la creación del sistema de alerta no solo mejoraron las capacidades de monitoreo de la plataforma de Devo, sino que también fortalecieron su postura de seguridad al permitir la detección temprana de fraudes y ataques.</p>",
          "technologies": [
            "Prometheus",
            "Grafana",
            "Kubernetes",
            "Docker",
            "Elastic Stack",
            "Kibana",
            "Python",
            "Bash",
            "Ansible",
            "GIT"
          ],
          "links": [],
          "images": []
        }
      ],
      "images": ["devo1.png", "devo2.png"]
    },
    {
      "name": "Comisión Europea",
      "short_description": "La Comisión Europea es el brazo ejecutivo de la Unión Europea, responsable de proponer legislación, implementar decisiones y gestionar los asuntos diarios.",
      "thumbnail": "European_Commission_01.png",
      "period_time": {
        "start": "Junio 2017",
        "end": "Enero 2020",
        "current": false
      },
      "full_description": "<p>La Comisión Europea es el brazo ejecutivo de la Unión Europea, responsable de proponer legislación, implementar decisiones, defender los tratados de la UE y gestionar los asuntos diarios de la UE. Los principales roles de la Comisión incluyen desarrollar estrategias y políticas, hacer cumplir las leyes de la UE y negociar acuerdos internacionales en nombre de la UE. Dentro de la Comisión Europea, la Dirección General de Competencia (DG COMP) juega un papel crucial. DG COMP es responsable de establecer e implementar la política de competencia para asegurar una competencia justa dentro del mercado interno de la UE.</p>",
      "contribution": "<p>En la Comisión Europea, trabajé como arquitecto de software en tres proyectos, con una amplia gama de responsabilidades que demostraron mi experiencia y liderazgo en el desarrollo de software. Mis principales responsabilidades incluyeron: Gestión de Requisitos No Funcionales y Definición del Proyecto : Usando Enterprise Architect, fui responsable de identificar y gestionar requisitos no funcionales, asegurando que cada proyecto estuviera claramente definido y alineado con los objetivos organizacionales. Gestión de Dependencias de Tareas : Usé Jira para gestionar dependencias entre tareas, asegurando un progreso fluido y minimizando retrasos. Definición de Perfiles de Miembros del Equipo : Definí los perfiles y roles de los miembros del equipo, asegurando que el equipo tuviera las habilidades y experiencia necesarias para tener éxito. Control de Calidad y Pruebas : Definí controles de calidad y protocolos de pruebas, incluyendo pruebas unitarias utilizando tecnologías como JUnit o Google Test/Valgrind, dependiendo del lenguaje de programación. Metodologías de Desarrollo de Software : Apliqué prácticas de Desarrollo Basado en Pruebas (TDD) y Desarrollo Basado en Comportamiento (BDD) para asegurar un desarrollo de software de alta calidad.</p>",
      "links": [
        {
          "text": "Sitio web de la Comisión Europea, DG COMP",
          "url": "https://competition-policy.ec.europa.eu/index_en"
        }
      ],
      "projects": [
        {
          "name": "Definición de dos APIs RESTful",
          "description": "<p>El primer proyecto involucró la definición de dos APIs RESTful que implementaron el Modelo de Madurez de Richardson Nivel 3, incorporando HATEOAS. Estas APIs fueron diseñadas como plataformas para el intercambio seguro de documentos legales en procedimientos antimonopolio. API Interna : La primera API estaba destinada a servir al personal interno de la Comisión Europea. El flujo de trabajo de cada procedimiento se gestionó utilizando el patrón de diseño State, y los administradores del sistema fueron notificados de los cambios de estado por correo electrónico.</p>",
          "technologies": [
            "Java",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "Spring IoC",
            "JPA",
            "Eclipselink",
            "WebLogic 12",
            "Oracle DB",
            "MongoDB",
            "Swagger",
            "JUnit",
            "AngularJS",
            "Selenium",
            "Maven",
            "GIT",
            "CAS",
            "Jira",
            "JUnit",
            "Bamboo",
            "SonarQube",
            "TDD",
            "BDD"
          ],
          "links": [
            {
              "text": "Documentación de e-leniency",
              "url": "https://competition-policy.ec.europa.eu/document/download/2fc568de-61ff-4aaf-9c9b-e03e96324ef7_en?filename=eleniency_guidance_access-notification.pdf"
            }
          ],
          "images": ["European_Commission_02.png"]
        },
        {
          "name": "E-Confidencialidad",
          "description": "<p>En el segundo proyecto, desempeñé un papel crucial como arquitecto de software, supervisando el desarrollo de un sistema sofisticado para negociar versiones confidenciales de documentación legal en procedimientos antimonopolio. Estos grupos, compuestos por personal interno, fueron verificados a través del Servicio Central de Autenticación (CAS), un sistema previamente implementado bajo mi dirección. Diseñé la arquitectura del sistema que rige el estado de cada documento utilizando el patrón de diseño Status, lo que permite la reversión de cambios, asegurando la integridad y precisión de los documentos legales durante el proceso de negociación. Además, seleccioné e integré Oracle DB y MongoDB como motores de base de datos, capitalizando sus fortalezas para gestionar eficientemente los complejos requisitos de datos del proyecto. A través de mi liderazgo y experiencia técnica, mejoré significativamente la capacidad del proyecto para proporcionar una plataforma segura, confiable y fácil de usar para negociar documentos legales sensibles, fortaleciendo así la eficacia de las acciones de aplicación antimonopolio.</p>",
          "technologies": [
            "AngularJS",
            "Ansible",
            "BDD",
            "Bamboo",
            "CAS",
            "Docker",
            "Eclipselink",
            "Enterprise Architect",
            "GIT",
            "IntelliJ IDEA",
            "JPA",
            "JUnit",
            "Java",
            "Jira",
            "Maven",
            "MongoDB",
            "Oracle DB",
            "Selenium",
            "SonarQube",
            "Spring Data",
            "Spring Documentation",
            "Spring IoC",
            "Spring MVC",
            "Spring Security",
            "Swagger",
            "TDD",
            "WebLogic 12"
          ],
          "links": [
            {
              "text": "Documentación de e-confidencialidad",
              "url": "https://competition-policy.ec.europa.eu/index/it-tools/econfidentiality_en"
            }
          ],
          "images": []
        },
        {
          "name": "Índice semántico de documentos legales",
          "description": "<p>El tercer proyecto, propuesto por mí, se centra en desarrollar un sistema sofisticado para la indexación semántica de documentos legales. El proyecto utiliza técnicas de clustering, específicamente el algoritmo K-Means, aplicadas al conjunto de datos de documentos legales del departamento antimonopolio. La capacidad de búsqueda semántica está potenciada por una red neuronal entrenada en el conjunto de datos de documentos legales antimonopolio, utilizando el framework TensorFlow. Este enfoque dual de servicios no solo facilita búsquedas semánticas de alta velocidad, sino que también asegura una indexación robusta y escalable de documentos legales complejos. El diseño del sistema enfatiza la resiliencia, eficiencia y precisión, convirtiéndolo en una herramienta vital para la gestión y recuperación de documentos legales en el departamento antimonopolio.</p>",
          "technologies": [
            "AngularJS",
            "Ansible",
            "Bamboo",
            "C++",
            "CUDA",
            "Cassandra",
            "Docker",
            "Eclipselink",
            "Enterprise Architect",
            "GIT",
            "Google Test",
            "Groovy",
            "IntelliJ IDEA",
            "JPA",
            "JUnit",
            "Java",
            "Jira",
            "Maven",
            "Microservices",
            "OpenCL",
            "Oracle DB",
            "Selenium",
            "SonarQube",
            "Spring Data",
            "Spring Documentation",
            "Spring MVC",
            "Spring Security",
            "Swagger",
            "TensorFlow",
            "Valgrind",
            "WebLogic 12",
            "gRPC"
          ],
          "links": [],
          "images": []
        },
        {
          "name": "Desarrollo de un sistema de distribución de energía renovable",
          "description": "<p>El cuarto proyecto implica el desarrollo de un sistema de distribución de energía renovable dentro de la red eléctrica, con el objetivo de normalizar y estabilizar el consumo eléctrico a lo largo del tiempo para maximizar la utilización de energías renovables. Desempeñé un papel significativo en este proyecto, contribuyendo extensamente tanto a su arquitectura como a su implementación. En el núcleo del sistema de comunicación se encuentra un clúster de mensajería basado en Kafka, donde la comunicación con dispositivos se gestiona a través de esquemas Avro. Este sistema de gateway se desarrolló en Go, utilizando el protocolo de comunicaciones ModBus en sus versiones serial y TCP, con las comunicaciones TCP aseguradas a través de una VPN. La gestión del software para este proyecto se maneja a través de la plataforma BalenaIO, que facilita el despliegue y operación de los dispositivos gateway. Mi contribución al aprovechar tecnologías avanzadas y desarrollar protocolos de comunicación robustos subraya mi papel significativo en este innovador proyecto destinado a mejorar la estabilidad y eficiencia del uso de energía renovable dentro de la red eléctrica.</p>",
          "technologies": [
            "Go",
            "Unit Test",
            "BalenaIO",
            "RaspberryPI",
            "Modbus",
            "Python",
            "Make",
            "Docker",
            "Kubernetes",
            "GCP",
            "Azure",
            "IoTHub",
            "Kafka",
            "Avro Schemas",
            "Ansible",
            "Elastic Search",
            "Kibana",
            "Jira",
            "Groovy"
          ],
          "links": [],
          "images": []
        }
      ],
      "images": []
    },
    {
      "name": "Panel Sistemas",
      "short_description": "Panel Sistemas es una empresa especializada en soluciones tecnológicas, ofreciendo servicios de software, consultoría y desarrollo a diversas industrias.",
      "thumbnail": "panel_sistemas.png",
      "period_time": {
        "start": "Septiembre 2015",
        "end": "Junio 2017",
        "current": false
      },
      "full_description": "<p>Panel Sistemas es una empresa líder en soluciones tecnológicas, especializada en desarrollo de software, consultoría y servicios de TI. Fundada en España, sirve a diversas industrias con clientes destacados como Telefónica, BBVA, Santander, Repsol y El Corte Inglés. Servicios Ofrecidos Desarrollo de Software: Soluciones de software a medida. Aseguramiento de Calidad: Pruebas de software completas.</p>",
      "contribution": "<p>Además, realicé tareas como programador senior en la fase posterior a la toma de decisiones. Mis responsabilidades como analista funcional incluyeron lo siguiente: Análisis de requisitos no funcionales y toma de decisiones sobre la implementación exacta de la solución (Redmine) Creación de sub-tareas con menor granularidad para lograr objetivos (Redmine) Estimación de tiempos (Redmine) Definición e implementación de la estructura del proyecto en las tecnologías especificadas Definición de la cobertura y calidad de las pruebas unitarias (JUnit, Google Test, Valgrind) Implementación de sistemas CI/CD (Jenkins) Utilización de SCRUM como metodología de desarrollo Aplicación de TDD y BDD en el desarrollo de software Impartición de sesiones de capacitación sobre TDD, BDD, Redes Neuronales, Código Limpio y más</p>",
      "links": [
        {
          "text": "Sitio web de Panel Sistemas",
          "url": "https://www.panel.es/"
        }
      ],
      "projects": [
        {
          "name": "Modernización de la mensajería de transporte marítimo y aéreo: reemplazo de IATA por XML/JSON",
          "description": "<p>Este proyecto reemplazó con éxito el estándar IATA obsoleto, basado en texto plano y propenso a errores humanos debido a su dependencia de la posición de la cadena de texto, con un formato más moderno, legible y resistente a errores basado en XML/JSON. Para lograr esto, definí un analizador que traducía mensajes del formato antiguo a cualquiera de los dos estándares modernos a través de una API Restful que cumplía con el modelo de madurez de Richardson Nivel 3.</p>",
          "technologies": [
            "Java",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "JPA",
            "Hibernate",
            "Wildfly/JBoss",
            "MongoDB",
            "RabbitMQ",
            "JUnit",
            "JSF",
            "Primefaces",
            "GWT",
            "AWS",
            "Phonegap",
            "Hadoop",
            "Selenium",
            "Maven",
            "GIT",
            "Jenkins",
            "Redmine",
            "IntelliJ IDEA",
            "Docker",
            "Ansible"
          ],
          "links": [],
          "images": ["iata.png"]
        },
        {
          "name": "Gestión Inteligente de Terminales de Iberdrola con Siemens",
          "description": "Estos terminales tomaban información sobre el consumo eléctrico del usuario enviando un informe diario al servidor utilizando el protocolo de comunicación SNMP, a menos que se deseara un monitoreo más detallado de un dispositivo o conjunto de dispositivos específico, en cuyo caso se generarían informes con un nivel de detalle que llegaría al consumo por minuto. Estos datos se almacenaban en una base de datos no relacional MongoDB, que por razones obvias eran varios clústeres, con balanceo de carga y fragmentos replicados. La información de cada punto se almacenaba en el clúster por proximidad geográfica, siempre que el servidor pudiera asumir el volumen de datos que incluía la inclusión de dicho nodo. La información de cada nodo se mantenía durante un año con un nivel de detalle de consumo por minuto, después de un año se compactaba generando el máximo, mínimo y promedio de cada día y esta información se mantenía a este nivel de detalle durante 5 años y pasado ese lapso de tiempo la información de cada nodo se compactaba nuevamente.",
          "technologies": [
            "C++",
            "Google Test",
            "Valgrind",
            "cLion",
            "Boost",
            "gRPC",
            "Microservices",
            "Java",
            "RabbitMQ",
            "JPA",
            "Hibernate",
            "Apache Tomcat",
            "MongoDB",
            "JUnit",
            "JSF",
            "Primefaces",
            "Hadoop",
            "Maven",
            "GIT",
            "Jenkins",
            "Jira",
            "IntelliJ IDEA",
            "Docker",
            "Ansible",
            "Kubernetes",
            "JNLP",
            "SNMP",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "Spring IOT"
          ],
          "links": [],
          "images": ["iberdrola.svg", "siemens.png"]
        },
        {
          "name": "Sistema de monitoreo y cuidado para personas con discapacidades o ancianos para Securitas Direct",
          "description": "<p>El tercer proyecto, ejecutado para Securitas Direct, implicó la creación de un sistema integral de monitoreo y cuidado para personas con discapacidades o ancianos. El sistema identificaba el estado del usuario basándose en diversos sensores distribuidos por su hogar, incluidos sensores de presencia, sensores de apertura de puertas y sensores personales de caídas. Estos datos se recopilaban para proporcionar información detallada sobre las actividades del usuario, que no solo se almacenaba y estaba accesible para consulta, sino que también era capaz de generar alarmas basadas en los patrones típicos de comportamiento del individuo.</p>",
          "technologies": [
            "C++",
            "Google Test",
            "Valgrind",
            "cLion",
            "Boost",
            "gRPC",
            "Microservices",
            "Java",
            "AWS",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "Spring IoC",
            "Spring Batch",
            "RabbitMQ",
            "JPA",
            "Hibernate",
            "Apache Tomcat",
            "Oracle DB",
            "JUnit",
            "Ionic",
            "Typescript",
            "Hadoop",
            "Selenium",
            "Jasmine",
            "Maven",
            "GIT",
            "Jenkins",
            "Jira",
            "Confluence",
            "IntelliJ IDEA",
            "Docker",
            "Ansible",
            "Kubernetes"
          ],
          "links": [],
          "images": []
        }
      ],
      "images": []
    },
    {
      "name": "Grupo Prisa",
      "short_description": "Grupo PRISA es un conglomerado de medios español, conocido por sus influyentes periódicos, emisoras de radio y publicaciones educativas.",
      "thumbnail": "prisa.png",
      "period_time": {
        "start": "Marzo 2012",
        "end": "Mayo 2015",
        "current": false
      },
      "full_description": "<p>Grupo PRISA, formalmente conocido como Promotora de Informaciones, S.A., es un destacado conglomerado de medios español con una significativa influencia en el mundo hispanohablante. Fundado en 1972 por Jesús de Polanco, PRISA ha crecido hasta convertirse en una de las mayores empresas de medios en España y América Latina, abarcando una amplia gama de medios, incluyendo periódicos, emisoras de radio, canales de televisión y publicaciones educativas. Aspectos clave de Grupo PRISA incluyen: Periódicos: El periódico insignia de PRISA es El País , uno de los diarios más leídos y respetados de España. Lanzado en 1976 durante la transición democrática de España, El País rápidamente se convirtió en un símbolo de la nueva era democrática, ofreciendo periodismo de alta calidad y una postura editorial progresista. Radio: En el sector de la radio, PRISA posee Cadena SER, la red de radio líder en España. Tiene una sustancial audiencia y es conocida por su completa cobertura de noticias y programas de tertulia que abordan asuntos de actualidad, política y problemas sociales. Otras emisoras destacadas bajo el paraguas de PRISA incluyen Los 40 Principales, una popular emisora de música que toca éxitos contemporáneos, y Cadena Dial, que se enfoca en música en español. Televisión: PRISA también ha incursionado en la televisión, con su canal CNN+ habiendo sido un jugador significativo en el mercado de noticias español hasta su cierre en 2010. Publicaciones Educativas: Más allá de las noticias y el entretenimiento, PRISA es un jugador importante en la industria de publicaciones educativas a través de su subsidiaria, Santillana. El contenido de la empresa es consumido por millones de personas en todo el mundo, convirtiéndolo en un puente cultural e informativo significativo entre España, América Latina y el resto del mundo.</p>",
      "contribution": "<p>Tengo una amplia experiencia trabajando como programador senior remoto en tres proyectos importantes. En este rol, se me confió una variedad de responsabilidades críticas que requerían tanto experiencia técnica como fuertes habilidades de comunicación. Uno de mis deberes principales fue asistir a reuniones con el propietario del producto para definir los requisitos detallados del proyecto. Esto implicaba un análisis exhaustivo de los objetivos del proyecto y desglosarlos en tareas específicas y procesables. Esta habilidad lingüística fue crucial para superar las brechas de comunicación y asegurar que todos los miembros del equipo, independientemente de su ubicación, tuvieran una comprensión clara y precisa de los requisitos del proyecto. Participé en sesiones de lluvia de ideas para desarrollar e implementar nuevas herramientas destinadas a mejorar la automatización y la productividad del equipo. Utilicé la metodología SCRUM para asegurar que todas las tareas estuvieran organizadas y gestionadas eficazmente a lo largo del ciclo de vida del proyecto. El uso de SCRUM permitió un enfoque flexible e iterativo para la gestión de proyectos, permitiendo que el equipo se adaptara a los cambios y abordara los desafíos de manera rápida. En general, mi experiencia como programador senior remoto me ha dotado de un conjunto de habilidades diverso y una profunda comprensión de la gestión efectiva de proyectos en un entorno de trabajo remoto y global. Mi capacidad para definir requisitos detallados, coordinar con equipos internacionales, innovar para mejorar la productividad y gestionar proyectos utilizando SCRUM me ha permitido contribuir significativamente al éxito de los proyectos en los que he estado involucrado.</p>",
      "links": [
        {
          "text": "Sitio web de Grupo Prisa",
          "url": "https://www.prisa.com/es"
        }
      ],
      "projects": [
        {
          "name": "Aplicación de visor de paquetes educativos",
          "description": "<p>El primer proyecto implicó el desarrollo de una aplicación integral para plataformas Android e iOS destinada a la visualización de paquetes educativos. Esta aplicación fue meticulosamente diseñada para ser compatible con dispositivos de gama baja, asegurando que pudiera alcanzar una base de usuarios más amplia sin comprometer el rendimiento. Una característica clave de la aplicación fue su capacidad para manejar paquetes educativos que cumplieran con el estándar SCORM (Modelo de Referencia de Objetos de Contenido Compartible), que se utiliza ampliamente en el campo del e-learning para crear y entregar contenido de aprendizaje interactivo y adaptativo. Esta doble compatibilidad aseguraba que los usuarios pudieran acceder a una amplia gama de contenido educativo, tanto moderno como antiguo, mejorando así la utilidad y el atractivo de la aplicación en varios contextos educativos.</p>",
          "technologies": [
            "Java",
            "Android Studio",
            "XCode",
            "Objective-C",
            "Dagger",
            "SCORM",
            "HTML",
            "JavaScript",
            "Bootstrap",
            "jQuery",
            "Jira",
            "GIT",
            "Confluence"
          ],
          "links": [],
          "images": []
        },
        {
          "name": "Proyecto de estandarización de paquetes educativos",
          "description": "<p>En un esfuerzo por ahorrar costos asociados con la migración de Flash a HTML5 bajo el estándar SCORM, se tomó la decisión de desarrollar una herramienta de traducción de Flash a HTML5. Esta herramienta facilitó la conversión de contenido educativo de Flash a HTML5, asegurando la compatibilidad con el estándar SCORM. Al mantener una biblioteca centralizada, la herramienta permitió que cualquier actualización al sistema central se aplicara de manera fluida a todos los paquetes creados anteriormente. El proyecto no solo logró ahorros de costos y mejoró la eficiencia, sino que también proporcionó un marco robusto para futuras actualizaciones y mejoras, asegurando la longevidad y adaptabilidad del contenido educativo.</p>",
          "technologies": [
            "C++",
            "Linux",
            "Flash",
            "HTML",
            "JavaScript",
            "AngularJS",
            "Bootstrap",
            "SCORM",
            "jQuery",
            "Jira",
            "GIT",
            "Confluence",
            "QEmu",
            "KVM",
            "Xen",
            "Bash",
            "NginX",
            "Valgrind"
          ],
          "links": [],
          "images": []
        },
        {
          "name": "Proyecto de plataforma educativa",
          "description": "<p>Esta plataforma permitía a los usuarios gestionar diversas tareas educativas, incluyendo la gestión de estudiantes, el manejo de paquetes educativos y el análisis de sus resultados. Además, la plataforma contaba con un centro de comunicación de audio y video de alta resolución vía IP, mejorando las interacciones en tiempo real entre educadores y estudiantes.</p>",
          "technologies": [
            "C#",
            ".NET",
            "IIS",
            "Windows Server",
            "Microsoft SQL Server",
            "Jira",
            "GIT",
            "Confluence"
          ],
          "links": [],
          "images": []
        }
      ],
      "images": []
    },
    {
      "name": "Intelygenz",
      "short_description": "Intelygenz es una empresa de tecnología especializada en inteligencia artificial, aprendizaje automático y soluciones de software a medida para diversas industrias.",
      "thumbnail": "intelygenz.png",
      "period_time": {
        "start": "Enero 2010",
        "end": "Enero 2012",
        "current": false
      },
      "full_description": "<p>Esta plataforma permitía a los usuarios gestionar diversas tareas educativas, incluyendo la gestión de estudiantes, el manejo de paquetes educativos y el análisis de sus resultados. Además, la plataforma contaba con un centro de comunicación de audio y video de alta resolución vía IP, mejorando las interacciones en tiempo real entre educadores y estudiantes.</p>",
      "contribution": "<p>Esta aplicación servía como una interfaz interactiva en tiempo real con el contenido televisivo, actualizada a través de marcadores inaudibles incrustados en el audio. El audio era interceptado por la aplicación, utilizando una solución personalizada desarrollada en el NDK de Android para asegurar un alto rendimiento y bajo consumo de batería.</p>",
      "links": [
        {
          "text": "Sitio web de Intelygenz",
          "url": "https://intelygenz.com/"
        }
      ],
      "projects": [
        {
          "name": "Proyecto de Antena 3 Televisión",
          "description": "<p>Esta aplicación servía como una interfaz interactiva en tiempo real con el contenido televisivo, actualizada dinámicamente utilizando marcadores inaudibles incrustados en el audio. Para lograr esto, la aplicación utilizaba una solución personalizada desarrollada en el NDK de Android, que aseguraba un mayor rendimiento y menor consumo de batería.</p>",
          "technologies": [
            "Java",
            "Android Studio",
            "Android NDK",
            "Jira",
            "GIT",
            "Confluence"
          ],
          "links": [
            {
              "text": "Documentación de la aplicación de Antena 3 TV",
              "url": "https://www.atresmediacorporacion.com/a3document/2012/05/24/DOCUMENTS/00012/00012.pdf"
            }
          ],
          "images": ["intelygenz_01.jpeg"]
        },
        {
          "name": "Proyecto de gestor de documentos para BBVA",
          "description": "<p>Especializado en documentos financieros, el gestor de documentos facilitaba la creación de grupos de edición, supervisión y acreditación, asegurando una gestión completa de varias tareas relacionadas con los documentos. Esta implementación no solo agilizó los procesos de manejo de documentos, sino que también aseguró que las operaciones del banco estuvieran alineadas con los estándares y mejores prácticas de la industria, mejorando así la eficiencia y colaboración entre diferentes departamentos y socios externos.</p>",
          "technologies": [
            "C#",
            ".NET",
            "IIS",
            "Windows Server",
            "Microsoft SQL Server",
            "Cassandra",
            "HTML",
            "JavaScript",
            "Bootstrap",
            "jQuery",
            "Jira",
            "GIT",
            "Confluence"
          ],
          "links": [],
          "images": ["bbva.jpg"]
        },
        {
          "name": "Proyecto de Front colaborativo",
          "description": "<p>El tercer proyecto involucró el desarrollo de un front-end colaborativo para el banco BBVA, utilizando tanto Java como JavaScript. Este proyecto se integró con el entorno NACAR, una plataforma diseñada para mejorar la funcionalidad y experiencia del usuario de aplicaciones bancarias. Esta biblioteca fue diseñada para mejorar la interacción del usuario proporcionando formas intuitivas y eficientes de realizar varias tareas.</p>",
          "technologies": [
            "Java",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "JPA",
            "Hibernate",
            "Websphere",
            "Oracle DB",
            "JUnit",
            "JSF",
            "Maven",
            "GIT",
            "Jira",
            "Confluence",
            "GIT",
            "Eclipse"
          ],
          "links": [],
          "images": ["bbva.jpg"]
        }
      ],
      "images": []
    },
    {
      "name": "UAH",
      "short_description": "La Universidad de Alcalá de Henares es una prestigiosa institución española conocida por su rica historia y diversos programas académicos.",
      "thumbnail": "uah.svg",
      "period_time": {
        "start": "Enero 2006",
        "end": "Enero 2009",
        "current": false
      },
      "full_description": "<p>La Universidad de Alcalá de Henares, comúnmente conocida como la Universidad de Alcalá, es una reconocida universidad pública ubicada en Alcalá de Henares, una ciudad histórica cerca de Madrid, España. La Universidad de Alcalá es celebrada por su compromiso con la excelencia académica y la innovación. La universidad es particularmente conocida por sus sólidos programas en literatura, lingüística y estudios de la lengua española, atrayendo a estudiantes y académicos de todo el mundo. Una de las características más notables de la universidad es su campus histórico, que es un sitio del Patrimonio Mundial de la UNESCO. El campus incluye impresionantes ejemplos de arquitectura renacentista española, como el Colegio de San Ildefonso, el edificio principal de la universidad, que cuenta con un hermoso patio y una capilla histórica. El compromiso de la universidad con la preservación de su patrimonio histórico y cultural es evidente en el mantenimiento y restauración cuidadosa de estos tesoros arquitectónicos. Además de su campus histórico, la Universidad de Alcalá cuenta con instalaciones modernas equipadas con la última tecnología para apoyar la investigación de vanguardia y métodos de enseñanza innovadores. Las bibliotecas, laboratorios y centros de investigación de la universidad proporcionan a los estudiantes y profesores los recursos que necesitan para perseguir sus metas académicas y profesionales. La vibrante vida estudiantil de la universidad incluye numerosas actividades culturales, sociales y deportivas, proporcionando a los estudiantes oportunidades para interactuar con la comunidad en general y desarrollar sus habilidades personales y profesionales. Un aspecto clave de la misión de la Universidad de Alcalá es su compromiso con la responsabilidad social y el desarrollo sostenible. La universidad mantiene fuertes conexiones con sus exalumnos, fomentando una comunidad de apoyo y comprometida que sigue contribuyendo al legado de la universidad.</p>",
      "contribution": "<p>Mi rol como investigador en la universidad fue dentro del grupo de investigación TIFyC, donde tuve una gama de responsabilidades enfocadas en avanzar en el campo de la tecnología y la inteligencia artificial. Una de mis principales tareas fue realizar investigaciones exhaustivas sobre el estado del arte en diversas áreas, incluyendo problemas de accesibilidad, algoritmos de IA, visión artificial y sistemas biométricos. Además de mis deberes de investigación, participé activamente en colaboraciones con grupos de investigación de diferentes universidades. Estas colaboraciones tenían como objetivo fomentar el intercambio de conocimientos, promover la investigación interdisciplinaria e impulsar proyectos innovadores. Al trabajar estrechamente con otros investigadores, pudimos combinar nuestra experiencia y recursos para abordar desafíos complejos y expandir los límites de nuestros respectivos campos. Otro aspecto clave de mi rol fue la preparación de informes detallados sobre nuestros hallazgos de investigación. Mi capacidad para comunicar claramente y de manera efectiva nuestros hallazgos fue crucial para asegurar que nuestro trabajo tuviera un impacto significativo. Mi rol de enseñanza me permitió compartir mi pasión por la IA y la visión artificial con la próxima generación de investigadores y profesionales, al mismo tiempo que me mantenía comprometido con la comunidad académica.</p>",
      "links": [
        {
          "text": "Sitio web de la Universidad de Alcalá",
          "url": "https://uah.es/"
        }
      ],
      "projects": [
        {
          "name": "Proyecto del grupo de investigación",
          "description": "<p>Uno de los proyectos significativos llevados a cabo por nuestro grupo de investigación se centró en investigar dispositivos innovadores diseñados para mejorar la interacción para individuos con discapacidades visuales, auditivas o motoras. Nuestro equipo exploró una amplia gama de tecnologías de asistencia y mejoras de interfaces de usuario destinadas a superar los desafíos que enfrentan las personas con discapacidades. Esto incluyó el desarrollo de dispositivos de entrada especializados, soluciones de software adaptativas y diseños avanzados de interfaces de usuario que se adaptaran específicamente a las necesidades de los usuarios con discapacidades visuales, auditivas y motoras. Al integrar comentarios de usuarios reales, nuestro grupo de investigación pudo hacer avances significativos en la creación de dispositivos y aplicaciones que no solo cumplieran con los estándares de accesibilidad, sino que también mejoraran la experiencia general del usuario para personas con discapacidades.</p>",
          "technologies": [
            "Java",
            "Android Studio",
            "Android",
            "Linux",
            "C++",
            "Anjuta",
            "Qt",
            "PIC",
            "Arduino",
            "SVN",
            "C#",
            ".NET",
            "Mono"
          ],
          "links": [],
          "images": ["tifyc.jpg"]
        },
        {
          "name": "Sistema de comunicación para dispositivos biométricos",
          "description": "<p>El segundo proyecto en el que trabajé implicó desarrollar un sistema de comunicación estandarizado para dispositivos biométricos. Para lograr esto, integramos un sistema de llamadas a procedimientos remotos (RPC) dentro de los propios dispositivos. Este sistema RPC aseguraba que la comunicación entre los dispositivos permaneciera transparente, independientemente del lenguaje de programación o sistema operativo utilizado. El proyecto requería una consideración cuidadosa de los problemas de interoperabilidad, ya que los dispositivos biométricos a menudo vienen con protocolos de comunicación propietarios y especificaciones técnicas diversas. Al implementar un sistema RPC estandarizado, pudimos abstraer las diferencias subyacentes y crear un protocolo de comunicación unificado. Este proyecto no solo mejoró la compatibilidad de los dispositivos, sino que también allanó el camino para futuros avances en tecnología biométrica, permitiendo a los fabricantes centrarse en la innovación sin preocuparse por las barreras de comunicación.</p>",
          "technologies": [
            "Java",
            "Linux",
            "C++",
            "Anjuta",
            "SVN",
            "C#",
            ".NET",
            "Mono"
          ],
          "links": [],
          "images": []
        },
        {
          "name": "Proyecto de página web del grupo de investigación",
          "description": "<p>El tercer proyecto involucró la creación y el mantenimiento continuo de la página web del grupo de investigación utilizando el Sistema de Gestión de Contenidos (CMS) Joomla. Este proyecto requería no solo el desarrollo inicial de una página web fácil de usar y visualmente atractiva, sino también la actualización y mejora continuas de sus características y contenido para satisfacer las necesidades en evolución del grupo de investigación. Aprovechando el robusto framework de Joomla, aseguré que el sitio web fuera tanto seguro como escalable, capaz de manejar un volumen creciente de contenido e interacciones de usuarios. En resumen, este proyecto demostró mi capacidad para desarrollar y gestionar una presencia web dinámica que respalda efectivamente los objetivos y actividades de un grupo especializado, utilizando las potentes características del CMS Joomla.</p>",
          "technologies": [
            "Java",
            "Linux",
            "C++",
            "Anjuta",
            "SVN",
            "C#",
            ".NET",
            "Mono"
          ],
          "links": [],
          "images": ["tifyc.jpg"]
        },
        {
          "name": "Contribuciones al grupo de investigación",
          "description": "<p>También organicé y conduje seminarios especializados enfocados en la Robótica, compartiendo conocimientos avanzados y los últimos desarrollos en el campo con mis colegas y estudiantes. En este rol, fui responsable de preparar y dictar conferencias, asistir en el diseño del curso y brindar orientación a los estudiantes sobre temas complejos relacionados con las tecnologías de IA y visión por computadora. Competí en el modo de resolución de laberintos, donde apliqué mi experiencia en robótica e IA para diseñar y programar robots capaces de navegar y resolver laberintos. Esta experiencia no solo mejoró mis habilidades técnicas, sino que también demostró mi capacidad para aplicar la investigación en entornos competitivos del mundo real.</p>",
          "technologies": [
            "C",
            "C++",
            "Arduino",
            "PIC",
            "Mathlab",
            "Octave",
            "Java",
            "Python"
          ],
          "links": [],
          "images": ["hispabot.jpeg"]
        }
      ],
      "images": []
    },
    {
      "name": "Knowcentury",
      "short_description": "Pequeña empresa dedicada a la creación de páginas web",
      "thumbnail": "knowcentury.png",
      "period_time": {
        "start": "Enero 2005",
        "end": "Julio 2005",
        "current": false
      },
      "full_description": "Pequeña empresa dedicada a la creación de páginas web",
      "contribution": "<p>Durante mis primeros años en la universidad, con el fin de poder pagar mis estudios, trabajé como programador web junior utilizando CMS en Knowcentury.</p>",
      "links": [],
      "projects": [
        {
          "name": "Desarrollo de sitios web",
          "description": "<p>Implementación de páginas web utilizando CMS como Joomla, Drupal y Moodle.</p>",
          "technologies": ["Joomla", "PHP", "JavaScript", "MySQL", "HTML"],
          "links": [],
          "images": []
        }
      ],
      "images": []
    },
    {
      "name": "IBM",
      "short_description": "IBM, una empresa tecnológica global, se especializa en computación en la nube, IA y hardware, proporcionando soluciones innovadoras para negocios en todo el mundo.",
      "thumbnail": "ibm.svg",
      "period_time": {
        "start": "Septiembre 2003",
        "end": "Diciembre 2004",
        "current": false
      },
      "full_description": "<p>IBM, o International Business Machines Corporation, es una empresa tecnológica de renombre mundial con una rica historia que abarca más de un siglo. Fundada en 1911 y con sede en Armonk, Nueva York, IBM ha estado constantemente a la vanguardia de la innovación tecnológica, influyendo en numerosos sectores con sus soluciones pioneras. Hoy en día, IBM es un líder en computación en la nube, inteligencia artificial (IA) y hardware empresarial, ofreciendo una suite completa de productos y servicios que atienden a negocios de todos los tamaños. Una de las contribuciones más significativas de IBM a la tecnología es su desarrollo de potentes sistemas de IA, particularmente la plataforma IBM Watson. Watson está diseñado para aprovechar el procesamiento del lenguaje natural y el aprendizaje automático para analizar grandes cantidades de datos, proporcionando información y habilitando la automatización en diversas industrias, incluyendo salud, finanzas y servicio al cliente. Las capacidades de IBM Watson en análisis de datos y análisis predictivo ayudan a las organizaciones a tomar decisiones más informadas, mejorar la eficiencia operativa e impulsar la innovación. Además de la IA, IBM ha hecho avances sustanciales en computación en la nube con su plataforma IBM Cloud. Esta robusta plataforma ofrece una amplia gama de servicios en la nube, incluyendo infraestructura como servicio (IaaS), plataforma como servicio (PaaS) y software como servicio (SaaS). IBM Cloud está diseñado para soportar tanto entornos de nube pública como privada, permitiendo a las empresas desplegar y gestionar aplicaciones con mayor flexibilidad y seguridad. La serie de mainframes IBM Z, por ejemplo, son conocidos por su fiabilidad, seguridad y rendimiento, particularmente en industrias que requieren capacidades robustas de procesamiento de datos, como la banca y las finanzas. IBM Quantum es una plataforma de computación avanzada que aprovecha los principios de la mecánica cuántica para resolver problemas complejos que están más allá de las capacidades de las computadoras clásicas. En resumen, IBM es un líder global en tecnología, ofreciendo soluciones innovadoras en IA, computación en la nube y hardware empresarial.</p>",
      "contribution": "<p>Durante este período, mi responsabilidad principal fue realizar una investigación exhaustiva sobre el uso del mainframe IBM System Z/390s para la virtualización de sistemas. El objetivo era habilitar el uso de sistemas remotos creando entornos virtualizados en el mainframe de IBM. Estos sistemas virtuales debían operar bajo el sistema operativo Suse Linux Enterprise Edition, asegurando una plataforma robusta y segura para diversas aplicaciones y servicios. Esto implicaba configurar y optimizar el mainframe para soportar múltiples máquinas virtuales, cada una ejecutando su instancia del Suse Linux Enterprise Edition. El uso de Suse Linux era crítico ya que proporcionaba la estabilidad necesaria y las características de nivel empresarial requeridas para sistemas virtuales de alto rendimiento y fiabilidad. El proyecto tenía como objetivo aprovechar el poder y la fiabilidad del IBM System Z/390s para proporcionar soluciones virtualizadas escalables y seguras para aplicaciones empresariales.</p>",
      "links": [],
      "projects": [
        {
          "name": "Desarrollo de sitios web",
          "description": "<p>Implementación de páginas web utilizando CMS como Joomla, Drupal y Moodle.</p>",
          "technologies": ["Joomla", "PHP", "JavaScript", "MySQL", "HTML"],
          "links": [],
          "images": ["ibm_system_z.jpg", "kvm.png", "suse.png"]
        }
      ],
      "images": []
    }
  ],
  "educations": {
    "university": [
      {
        "university_name": "UAH",
        "title": "Máster en Inteligencia Artificial en tecnologías de la información y la comunicación",
        "period_time": {
          "start": "Septiembre 2007",
          "end": "Junio 2009",
          "current": false
        },
        "summary": "Inteligencia artificial y aprendizaje automático. Supervisado, no supervisado y reforzado. Aprendizaje simbólico. Modelos de clasificación y regresión. Redes profundas. Redes multicapa, retropropagación. Hiperparámetros y estrategias de aprendizaje. Redes convolucionales. Redes secuenciales y recurrentes. Técnicas de paralelización y computación en arquitecturas basadas en GPU.",
        "images": ["uah.svg"],
        "thumbnail": "uah.svg"
      },
      {
        "university_name": "UAH",
        "title": "Ingeniería Técnica en Informática",
        "period_time": {
          "start": "Septiembre 2001",
          "end": "Junio 2007",
          "current": false
        },
        "summary": "Con honores en: Inteligencia Artificial, Lógica Difusa, Sistemas de Visión Artificial, Física II, Análisis Matemático, Estructura de Datos, Redes.",
        "images": ["uah.svg"],
        "thumbnail": "uah.svg"
      }
    ],
    "complementary": [
      {
        "institution": "Fundación Linux",
        "title": "LPIC - 2",
        "period_time": {
          "start": "Septiembre 2015",
          "end": "",
          "current": true
        },
        "summary": "Certificación oficial de administración de sistemas Linux que implica la calificación para: Administración avanzada de sistemas Linux, incluidos los relacionados con el kernel. Realizar gestión avanzada del almacenamiento de bloques y sistemas de archivos, así como la autenticación avanzada de redes y la seguridad del sistema, incluidos el firewall y la VPN Instalar y configurar servicios centrales de red (DHCP, DNS, SSH, servidores web, servidores de archivos, correo electrónico, etc.).",
        "images": ["linux_foundation.png"],
        "thumbnail": "linux_foundation.png"
      },
      {
        "institution": "Fundación Linux",
        "title": "LPIC - 1",
        "period_time": {
          "start": "Septiembre 2013",
          "end": "",
          "current": true
        },
        "summary": "Certificación oficial de administración de sistemas Linux que implica la calificación para: Instalar un sistema Linux, incluido X11 y configurarlo como un cliente de red. Gestionar archivos y permisos de acceso, incluidos ACL, así como la seguridad del sistema.",
        "images": ["linux_foundation.png"],
        "thumbnail": "linux_foundation.png"
      },
      {
        "institution": "Universidad de Alcalá de Henares",
        "title": "Diseño y evaluación de contenidos educativos digitales",
        "period_time": {
          "start": "Septiembre 2007",
          "end": "",
          "current": true
        },
        "summary": "Diseño de contenido educativo a través del estándar SCORM.",
        "images": ["uah.svg"],
        "thumbnail": "uah.svg"
      },
      {
        "institution": "Universidad de Alcalá de Henares",
        "title": "Curso de visión artificial",
        "period_time": {
          "start": "Septiembre 2007",
          "end": "",
          "current": true
        },
        "summary": "Sistemas de visión artificial, matrices de convolución, filtros.",
        "images": ["uah.svg"],
        "thumbnail": "uah.svg"
      }
    ],
    "languages": [
      {
        "language": "Español",
        "spoken": "nativo",
        "writen": "nativo",
        "read": "nativo",
        "thumbnail": "spanish.png",
        "acreditation": []
      },
      {
        "language": "Inglés",
        "spoken": "fluido",
        "writen": "fluido",
        "read": "fluido",
        "thumbnail": "english.svg",
        "acreditation": []
      },
      {
        "language": "Chino",
        "spoken": "fluido",
        "writen": "fluido",
        "read": "fluido",
        "thumbnail": "chinese.png",
        "acreditation": [
          {
            "institution": "Instituto Confucio Madrid",
            "title": "HSK 3",
            "period_time": {
              "start": "Septiembre 2009",
              "end": "",
              "current": true
            }
          }
        ]
      }
    ]
  }
}
