{
  "intro": {
    "greeting": "¡Hola! Soy Israel, un dev senior empedernido viajando por el mundo.",
    "profile_image": "israel.png",
    "name": "Israel López",
    "title": "Ingeniero de Software Senior",
    "summary": [
      "<P>Mi mochila está llena de código y de ganas de seguir aprendiendo. ¡La programación es mi superpoder!</P>",
      "<P>Desde los 13 me picó el gusanillo de la programación y no he podido parar. ¡En cualquier rincón del mundo, con mi portátil bajo el brazo!</P>",
      "<P>Me considero una mente inquieta por las ganas insaciables que tengo de aprender,  innovar y superar nuevos retos intelectuales. Disfruto de la sensación de ver cómo una idea se convierte en realidad a través de código.</P>",
      "<P>Tengo la suerte de que la programación no solo es mi trabajo, también es mi pasión y si hay algo que me caracteriza es mi insistencia por encontrar la solución óptima al proyecto.  Porque si, me  enorgullece entregar código limpio y eficiente.</P>",
      "<P>Si conectamos, ¿estás listo para embarcarte en una nueva aventura tecnológica conmigo?</P>"
    ],
    "bio": [
      {
        "dates": "1983",
        "text": "Nací en Madrid, España"
      },
      {
        "dates": "2007",
        "text": "Complete la licenciatura en Informática en la Universidad de Alcalá de Henares"
      },
      {
        "dates": "2009",
        "text": "Complete el Master en Inteligencia Artificila en información y comunicación de tecnologias en la Universidad de Alcalá de Henares."
      },
      {
        "dates": "2004 a la actualidad",
        "text": "Trabajando como empleado"
      }
    ],
    "hobbies": [
      "🧗 escalada, 🏂 snowboard, 🧭 viajar, 🤿 buceo, ⨋ matemáticas (especialmente álgebra lineal y estadísticas), 🧠 Inteligencia Artificial."
    ],
    "links": [
      {
        "icon": "",
        "url": "https://github.com/israellopezdeveloper",
        "text": "@israellopezdeveloper"
      },
      {
        "icon": "󰇮",
        "url": "mailto:israel.lopez.developer@gmail.com",
        "text": "israel.lopez.developer@gmail.com"
      },
      {
        "icon": "󰌻",
        "url": "https://www.linkedin.com/in/israellopezmaiz/",
        "text": "https://www.linkedin.com/in/israellopezmaiz/"
      },
      {
        "icon": "",
        "url": "tel:+34648136640",
        "text": "+34 648 13 66 40"
      }
    ]
  },
  "works": [
    {
      "name": "Devo",
      "title": "Ingeniero Software Senior",
      "short_description": [
        "Empresa nativa de la nube que ofrece análisis de seguridad en tiempo real, aprendizaje automático y soluciones escalables para la gestión de datos empresariales."
      ],
      "thumbnail": "devo.png",
      "period_time": "Marzo 2020 - Marzo 2024",
      "full_description": [
        "<P>Devo es una empresa líder en análisis de registros y seguridad nativa en la nube, dedicada a proporcionar conocimientos en tiempo real y análisis avanzados para datos empresariales. Su robusta plataforma permite a las organizaciones detectar, analizar y responder eficientemente a amenazas de seguridad, aprovechando el poder del aprendizaje automático y una arquitectura altamente escalable. Las soluciones de Devo están diseñadas para manejar grandes volúmenes de datos, asegurando que las empresas puedan mantener altos niveles de rendimiento y seguridad. Sirviendo a una amplia gama de industrias, incluidas finanzas y telecomunicaciones, Devo mejora las medidas de ciberseguridad y optimiza las prácticas de gestión de datos, ayudando a las empresas a mantenerse por delante de las amenazas y requisitos regulatorios en evolución. Con un compromiso con la innovación y la excelencia, Devo está a la vanguardia de la transformación de cómo las empresas abordan la seguridad y el análisis de datos.</P>"
      ],
      "contribution": [
        "<P>En Devo, desempeñé un papel crucial en el equipo de ingesta de datos, centrándome específicamente en el balanceador de carga. Dada la sensibilidad de los datos y su importancia para diagnosticar posibles ataques, el servicio debía ser tanto fiable como rápido. Bajo mi experiencia, el sistema pudo manejar un impresionante volumen de ingesta de aproximadamente 60TB por día. Además, contribuí significativamente a los esfuerzos de Devo para adaptarse a los estándares necesarios para la integración con sistemas federales de EE.UU., logrando la certificación FedRAMP. Asimismo, participé en la creación de un sistema de respaldo multirregional y multicloud, asegurando la redundancia y fiabilidad de los datos en diversos entornos. Mi trabajo garantizó que la plataforma de Devo cumpliera con los más altos niveles de seguridad y cumplimiento, mejorando la capacidad de la empresa para servir eficazmente a sus clientes.</P>"
      ],
      "links": [
        {
          "tag": "Sitio web",
          "url": "https://www.devo.com/es/",
          "text": "Sitio web de Devo"
        }
      ],
      "projects": [
        {
          "name": "Mejorar el balanceador de carga existente",
          "description": [
            "<P>Contribuí significativamente a mejorar el rendimiento del balanceador de carga de Devo mediante la implementación de estrategias avanzadas que mejoraron la tolerancia a fallos y optimizaron la monitorización de los servicios de ingesta de datos. Analicé meticulosamente los requisitos del sistema e identifiqué áreas clave de mejora, asegurando que el balanceador de carga pudiera manejar niveles variables de tráfico con mayor eficiencia. Mis esfuerzos en mejorar los mecanismos de tolerancia a fallos ayudaron al sistema a recuperarse rápidamente de fallos inesperados, manteniendo alta disponibilidad y fiabilidad. Además, creé soporte para el protocolo RELP (Reliable Event Logging Protocol) desde cero, asegurando un registro de eventos fiable y eficiente en todo el sistema.</P>",
            "<P>Asimismo, desarrollé métodos para equilibrar la carga basado en el cliente, lo que facilitó consultas de datos más compactas. Al asegurar que los datos no se mezclaran innecesariamente en todos los nodos, agilice el proceso de recuperación de datos, haciéndolo más rápido y eficiente. Este enfoque de balanceo de carga específico para clientes no solo mejoró el rendimiento de las consultas sino que también redujo la sobrecarga en el sistema. Mis contribuciones llevaron a un sistema de balanceo de carga más robusto y receptivo, mejorando significativamente el rendimiento y la experiencia del usuario en Devo.</P>"
          ],
          "links": [
            {
              "tag": "Documentación",
              "url": "https://docs.devo.com/space/latest/94653692/Event+load+balancers",
              "text": "Documentación del balanceador de carga"
            }
          ],
          "technologies": [
            "Node.js",
            "C",
            "C++",
            "FIPS",
            "FedRAMP",
            "SonarQube",
            "Snyk",
            "Owasp",
            "Jenkins",
            "Gitlab CI/CD",
            "Kubernetes",
            "GIT",
            "Jira",
            "TDD",
            "BDD"
          ]
        },
        {
          "name": "Crear un sistema de respaldo multicloud",
          "description": [
            "<P>Encabecé el desarrollo de un sistema de respaldo multicloud de última generación desde cero, un avance crucial para las capacidades de redundancia y recuperación ante desastres de Devo. Este sistema fue diseñado para almacenar registros de clientes en múltiples regiones y entornos en la nube, asegurando la máxima protección y disponibilidad de los datos. Una de las características clave de este sistema fue su capacidad para configurar tipos de almacenamiento en tiempo real, permitiendo ajustes fluidos a las configuraciones de almacenamiento en la nube basados en necesidades y criterios en tiempo real.</P>",
            "<P>Implementé criterios sofisticados de transición de datos, que automatizaron el movimiento de datos entre diversas clases de almacenamiento basándose en patrones de uso y políticas de retención. Esta característica aseguraba que los datos siempre se almacenaran de la manera más rentable y eficiente, sin comprometer la accesibilidad o el rendimiento.</P>",
            "<P>Además de esto, mi sistema incluía mecanismos robustos de recuperación de nodos, permitiendo una rápida restauración del servicio en caso de falla de un nodo. Esto redujo significativamente el tiempo de inactividad y mantuvo la integridad y disponibilidad de los datos críticos. Para mejorar aún más la eficiencia del sistema, desarrollé métodos avanzados de compactación de datos para los datos que estaban cerca del final de su vida útil, optimizando el uso del almacenamiento y reduciendo la sobrecarga.</P>",
            "<P>Finalmente, integré horarios precisos de limpieza del sistema, asegurando que los datos obsoletos se eliminaran oportunamente, manteniendo un rendimiento óptimo del sistema y la salud del almacenamiento. Mis contribuciones a este sistema de respaldo multicloud no solo fortalecieron las capacidades de gestión de datos de Devo sino que también garantizaron el cumplimiento de estrictas regulaciones de seguridad y retención de datos. Este proyecto destacó mi experiencia en la creación de soluciones de almacenamiento de datos resilientes, escalables y altamente eficientes, reforzando el compromiso de Devo con la excelencia en seguridad y análisis de datos.</P>"
          ],
          "links": [],
          "technologies": [
            "Java",
            "AWS",
            "GCP",
            "FIPS",
            "FedRAMP",
            "SonarQube",
            "Snyk",
            "Owasp",
            "Jenkins",
            "Gitlab CI/CD",
            "Kubernetes",
            "GIT",
            "Jira",
            "TDD",
            "BDD"
          ]
        },
        {
          "name": "Integrar revisiones de calidad y seguridad en el pipeline CI/CD",
          "description": [
            "<P>Jugué un papel fundamental en la integración de revisiones comprensivas de calidad y seguridad en el pipeline CI/CD de Devo. Esta iniciativa fue crucial para elevar el proceso de desarrollo a cumplir con los estrictos estándares de la industria, incluyendo NIST, FIPS y FedRAMP.</P>",
            "<P><b>Integración del Pipeline Jenkins</b></P>",
            "<P>Inicialmente, me centré en incorporar SonarQube en el pipeline Jenkins para el análisis continuo de calidad del código. Configuré SonarQube para realizar análisis estático del código, lo que permitió al equipo detectar olores de código, errores y posibles vulnerabilidades temprano en el ciclo de desarrollo. Esta integración aseguró que solo se fusionara código de alta calidad, reduciendo significativamente la cantidad de problemas que llegaban a producción.</P>",
            "<P><b>Transición a GitLab CI/CD</b></P>",
            "<P>Tras el éxito con Jenkins, hice la transición del pipeline a GitLab CI/CD. Aproveché las características avanzadas de GitLab para agilizar el proceso y mejorar la automatización de las implementaciones de código. Este cambio facilitó una mejor colaboración y eficiencia en todo el equipo de desarrollo.</P>",
            "<P><b>Escaneo de Vulnerabilidades de Seguridad</b></P>",
            "<P>Para abordar las vulnerabilidades de seguridad, integré Snyk y OWASP en el pipeline CI/CD. Snyk proporcionó escaneos en tiempo real de dependencias de código abierto, identificando y sugiriendo soluciones para vulnerabilidades conocidas. Mientras tanto, se utilizaron herramientas OWASP para realizar evaluaciones de seguridad exhaustivas, enfocándose en identificar y mitigar riesgos asociados con aplicaciones web.</P>",
            "<P><b>Lograr Estándares de Cumplimiento</b></P>",
            "<P>Mi trabajo meticuloso aseguró que el pipeline cumpliera con los rigurosos estándares requeridos por NIST, FIPS y FedRAMP. Establecí verificaciones y balances automatizados dentro del proceso CI/CD, garantizando que cada cambio de código pasara por revisiones exhaustivas de calidad y seguridad antes de su implementación. Esto no solo mejoró la postura general de seguridad de las aplicaciones, sino que también agilizó el proceso de verificación de cumplimiento, facilitando que Devo demostrara adherencia a estos estándares críticos.</P>",
            "<P><b>Resultado</b></P>",
            "<P>Mis contribuciones mejoraron significativamente la robustez del pipeline CI/CD de Devo, asegurando que la calidad y seguridad del código se mantuvieran en los más altos niveles. La integración de SonarQube, Snyk y herramientas OWASP en el pipeline resultó en un proceso de desarrollo más seguro y eficiente, alineado con el compromiso de la empresa con la innovación y la excelencia. Este proyecto fue un paso crucial para mantener la posición de Devo a la vanguardia de la ciberseguridad y el análisis de datos, proporcionando a los clientes soluciones confiables y seguras.</P>"
          ],
          "links": [],
          "technologies": [
            "Gitlab CI/CD",
            "Jenkins",
            "NIST",
            "FIPS",
            "FedRAMP",
            "SonarQube",
            "Snyk",
            "Owasp",
            "Kubernetes",
            "Jira"
          ]
        },
        {
          "name": "Creación de un sistema de alerta para monitoreo con Prometheus",
          "description": [
            "<P>Fui fundamental en el desarrollo de un sistema de alerta integral diseñado para monitorear el rendimiento y situaciones críticas en entornos de producción utilizando Prometheus. Reconociendo la necesidad de monitoreo en tiempo real y mecanismos de respuesta rápida, diseñé una solución que proporcionaba conocimientos detallados sobre el rendimiento del sistema y detectaba posibles problemas como fraudes, ataques y otras anomalías.</P>",
            "<P>Para lograr esto, integré Prometheus en la infraestructura de Devo, configurando mecanismos robustos de recopilación de métricas y alertas. Definí indicadores clave de rendimiento (KPIs) y umbrales cruciales para mantener la salud y estabilidad del sistema. Aprovechando las potentes capacidades de consulta de Prometheus, establecí una serie de reglas de alerta que podían identificar patrones anormales en la ingesta de datos, tiempos de procesamiento y uso de recursos del sistema.</P>",
            "<P>Además de configurar el sistema de alerta, desarrollé una guía completa de solución de problemas para asistir al equipo de operaciones en el diagnóstico y resolución de problemas rápidamente. Esta guía incluía procedimientos paso a paso para identificar la causa raíz de las alertas, acciones recomendadas y protocolos de escalación. La guía aseguraba que los miembros del equipo tuvieran una comprensión clara de cómo manejar diferentes tipos de alertas, desde degradaciones menores del rendimiento hasta fallas críticas del sistema.</P>",
            "<P>Asimismo, implementé acciones automatizadas de respuesta temprana para mitigar posibles problemas antes de que se escalaran. Estas acciones automatizadas incluían reiniciar servicios, redistribuir la carga y escalar recursos dinámicamente según la naturaleza y gravedad de las alertas. Al automatizar estas respuestas iniciales, reduje significativamente el tiempo medio de recuperación (MTTR) y minimicé el impacto de los problemas en los usuarios finales.</P>",
            "<P>Para mejorar la efectividad general del sistema de monitoreo, también diseñé protocolos para manejar situaciones críticas del sistema. Estos protocolos delinearon los roles y responsabilidades de los miembros del equipo, estrategias de comunicación y esfuerzos de coordinación requeridos durante incidentes mayores. Este enfoque estructurado aseguró una respuesta rápida y coordinada, reduciendo el tiempo de inactividad y manteniendo la fiabilidad del servicio.</P>",
            "<P>Mis contribuciones a la creación del sistema de alerta no solo mejoraron las capacidades de monitoreo de la plataforma de Devo, sino que también fortalecieron su postura de seguridad al permitir la detección temprana de fraudes y ataques. Mi trabajo aseguró que el sistema pudiera mantener un alto rendimiento y resiliencia, proporcionando a los clientes de Devo una plataforma de análisis de datos confiable y segura.</P>"
          ],
          "links": [],
          "technologies": [
            "Prometheus",
            "Grafana",
            "Kubernetes",
            "Docker",
            "Elastic Stack",
            "Kibana",
            "Python",
            "Bash",
            "Ansible",
            "GIT"
          ]
        }
      ],
      "images": [
        "devo1.png",
        "devo2.png"
      ]
    },
    {
      "name": "Comisión Europea",
      "title": "Arquitecto Software",
      "short_description": [
        "La Comisión Europea es el brazo ejecutivo de la Unión Europea, responsable de proponer legislación, implementar decisiones y gestionar los asuntos diarios."
      ],
      "thumbnail": "European_Commission_01.png",
      "period_time": "Junio 2017 - Enero 2020",
      "full_description": [
        "<P>La Comisión Europea es el brazo ejecutivo de la Unión Europea, responsable de proponer legislación, implementar decisiones, defender los tratados de la UE y gestionar los asuntos diarios de la UE. Opera como un gobierno de gabinete, con 27 miembros de la Comisión (uno de cada estado miembro) encabezados por un Presidente. Los principales roles de la Comisión incluyen desarrollar estrategias y políticas, hacer cumplir las leyes de la UE y negociar acuerdos internacionales en nombre de la UE.</P>",
        "<P>Dentro de la Comisión Europea, la Dirección General de Competencia (DG COMP) juega un papel crucial. DG COMP es responsable de establecer e implementar la política de competencia para asegurar una competencia justa dentro del mercado interno de la UE. Esto incluye hacer cumplir las leyes antimonopolio, supervisar fusiones y adquisiciones y prevenir prácticas monopolísticas y ayudas estatales que podrían distorsionar la competencia. DG COMP trabaja para proteger a consumidores y empresas promoviendo la innovación, asegurando una igualdad de condiciones y mejorando la eficiencia económica.</P>",
        "<P>Trabajé en DG COMP, contribuyendo a los esfuerzos de la Comisión para mantener mercados competitivos y fomentar el crecimiento económico en toda la Unión Europea.</P>"
      ],
      "contribution": [
        "<P>En la Comisión Europea, trabajé como arquitecto de software en tres proyectos, con una amplia gama de responsabilidades que demostraron mi experiencia y liderazgo en el desarrollo de software. Mis principales responsabilidades incluyeron:</P>",
        "<ul>",
        "<li><b>Gestión de Requisitos No Funcionales y Definición del Proyecto</b>: Usando Enterprise Architect, fui responsable de identificar y gestionar requisitos no funcionales, asegurando que cada proyecto estuviera claramente definido y alineado con los objetivos organizacionales.</li>",
        "<li><b>Priorización de Tareas</b>: Utilizando Jira, prioricé tareas eficazmente para asegurar que los elementos más críticos se abordaran de manera oportuna.</li>",
        "<li><b>Gestión de Dependencias de Tareas</b>: Usé Jira para gestionar dependencias entre tareas, asegurando un progreso fluido y minimizando retrasos.</li>",
        "<li><b>Selección de Tecnología</b>: Fui fundamental en la selección de tecnologías apropiadas para cada proyecto, asegurando que fueran adecuadas para cumplir con las necesidades del proyecto.</li>",
        "<li><b>Definición de Perfiles de Miembros del Equipo</b>: Definí los perfiles y roles de los miembros del equipo, asegurando que el equipo tuviera las habilidades y experiencia necesarias para tener éxito.</li>",
        "<li><b>Colaboración entre Equipos</b>: Facilitó la colaboración entre diferentes equipos cuyos proyectos necesitaban integrarse, asegurando una integración y cooperación sin problemas.</li>",
        "<li><b>Control de Calidad y Pruebas</b>: Definí controles de calidad y protocolos de pruebas, incluyendo pruebas unitarias utilizando tecnologías como JUnit o Google Test/Valgrind, dependiendo del lenguaje de programación.</li>",
        "<li><b>Implementación de Sistemas CI/CD</b>: Definí e implementé sistemas de Integración Continua y Despliegue Continuo utilizando herramientas como Bamboo y SonarQube.</li>",
        "<li><b>Metodologías de Desarrollo de Software</b>: Apliqué prácticas de Desarrollo Basado en Pruebas (TDD) y Desarrollo Basado en Comportamiento (BDD) para asegurar un desarrollo de software de alta calidad.</li>",
        "<li><b>Metodología Ágil</b>: Utilicé SCRUM como la metodología principal para la gestión de proyectos, fomentando un proceso de desarrollo ágil y eficiente.</li>",
        "</ul>"
      ],
      "links": [
        {
          "tag": "Sitio web",
          "url": "https://competition-policy.ec.europa.eu/index_en",
          "text": "Sitio web de la Comisión Europea, DG COMP"
        }
      ],
      "projects": [
        {
          "name": "Definición de dos APIs RESTful",
          "description": [
            "<P>El primer proyecto involucró la definición de dos APIs RESTful que implementaron el Modelo de Madurez de Richardson Nivel 3, incorporando HATEOAS. Estas APIs fueron diseñadas como plataformas para el intercambio seguro de documentos legales en procedimientos antimonopolio.</P>",
            "<ul>",
            "<li><b>API Interna</b>: La primera API estaba destinada a servir al personal interno de la Comisión Europea.</li>",
            "<li><b>API Externa</b>: La segunda API sirvió como plataforma para el personal externo.</li>",
            "</ul>",
            "Ambas APIs contaban con control de acceso a través de un sistema de Inicio de Sesión Único llamado CAS. La persistencia de datos se gestionó utilizando tanto Oracle DB como MongoDB. Además, las APIs se integraron con un proyecto interno de almacenamiento seguro de documentos a través de una interfaz SOAP. El flujo de trabajo de cada procedimiento se gestionó utilizando el patrón de diseño State, y los administradores del sistema fueron notificados de los cambios de estado por correo electrónico."
          ],
          "links": [
            {
              "tag": "Documentación",
              "url": "https://competition-policy.ec.europa.eu/document/download/2fc568de-61ff-4aaf-9c9b-e03e96324ef7_en?filename=eleniency_guidance_access-notification.pdf",
              "text": "Documentación de e-leniency"
            }
          ],
          "images": [
            "European_Commission_02.png"
          ],
          "technologies": [
            "Java",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "Spring IoC",
            "JPA",
            "Eclipselink",
            "WebLogic 12",
            "Oracle DB",
            "MongoDB",
            "Swagger",
            "JUnit",
            "AngularJS",
            "Selenium",
            "Maven",
            "GIT",
            "CAS",
            "Jira",
            "JUnit",
            "Bamboo",
            "SonarQube",
            "TDD",
            "BDD"
          ]
        },
        {
          "name": "E-Confidencialidad",
          "description": [
            "<P>En el segundo proyecto, desempeñé un papel crucial como arquitecto de software, supervisando el desarrollo de un sistema sofisticado para negociar versiones confidenciales de documentación legal en procedimientos antimonopolio. Mis contribuciones fueron fundamentales para establecer y asignar grupos de verificación dinámicos responsables de gestionar procesos legales en línea. Estos grupos, compuestos por personal interno, fueron verificados a través del Servicio Central de Autenticación (CAS), un sistema previamente implementado bajo mi dirección.</P>",
            "<P>Diseñé la arquitectura del sistema que rige el estado de cada documento utilizando el patrón de diseño Status, lo que permite la reversión de cambios, asegurando la integridad y precisión de los documentos legales durante el proceso de negociación. Mi experiencia aseguró que cualquier modificación pudiera deshacerse, manteniendo la fidelidad de los documentos.</P>",
            "<P>Además, seleccioné e integré Oracle DB y MongoDB como motores de base de datos, capitalizando sus fortalezas para gestionar eficientemente los complejos requisitos de datos del proyecto. Aseguré que la implementación siguiera el Modelo de Madurez de Richardson Nivel 3, incorporando principios de HATEOAS (Hypermedia as the Engine of Application State). Este enfoque garantizó un sistema robusto y escalable capaz de soportar los intrincados flujos de trabajo involucrados en los procedimientos legales antimonopolio.</P>",
            "<P>A través de mi liderazgo y experiencia técnica, mejoré significativamente la capacidad del proyecto para proporcionar una plataforma segura, confiable y fácil de usar para negociar documentos legales sensibles, fortaleciendo así la eficacia de las acciones de aplicación antimonopolio. Mi trabajo como arquitecto de software fue crucial para lograr los objetivos del proyecto y asegurar su éxito.</P>"
          ],
          "links": [
            {
              "tag": "Documentación",
              "url": "https://competition-policy.ec.europa.eu/index/it-tools/econfidentiality_en",
              "text": "Documentación de e-confidencialidad"
            }
          ],
          "technologies": [
            "AngularJS",
            "Ansible",
            "BDD",
            "Bamboo",
            "CAS",
            "Docker",
            "Eclipselink",
            "Enterprise Architect",
            "GIT",
            "IntelliJ IDEA",
            "JPA",
            "JUnit",
            "Java",
            "Jira",
            "Maven",
            "MongoDB",
            "Oracle DB",
            "Selenium",
            "SonarQube",
            "Spring Data",
            "Spring Documentation",
            "Spring IoC",
            "Spring MVC",
            "Spring Security",
            "Swagger",
            "TDD",
            "WebLogic 12"
          ]
        },
        {
          "name": "Índice semántico de documentos legales",
          "description": [
            "<P>El tercer proyecto, propuesto por mí, se centra en desarrollar un sistema sofisticado para la indexación semántica de documentos legales. Actué como arquitecto de este proyecto, involucrándome profundamente en el proceso de programación para asegurar su éxito. El proyecto utiliza técnicas de clustering, específicamente el algoritmo K-Means, aplicadas al conjunto de datos de documentos legales del departamento antimonopolio. El proceso de indexación está integrado en un microservicio diseñado con el framework gRPC, implementado en C++14 para asegurar la máxima eficiencia y rendimiento.</P>",
            "<P>La arquitectura de estos microservicios sigue el paradigma de Segregación de Responsabilidad de Comandos y Consultas (CQRS), desplegado en un pool de servicios para garantizar la resiliencia y tiempos de respuesta rápidos. La capacidad de búsqueda semántica está potenciada por una red neuronal entrenada en el conjunto de datos de documentos legales antimonopolio, utilizando el framework TensorFlow. Además, desarrollé un servicio complementario en Java, que aprovecha esta herramienta de búsqueda semántica para mejorar su funcionalidad.</P>",
            "<P>Este enfoque dual de servicios no solo facilita búsquedas semánticas de alta velocidad, sino que también asegura una indexación robusta y escalable de documentos legales complejos. El diseño del sistema enfatiza la resiliencia, eficiencia y precisión, convirtiéndolo en una herramienta vital para la gestión y recuperación de documentos legales en el departamento antimonopolio. Mi iniciativa y participación activa en la arquitectura y programación fueron cruciales para el éxito del proyecto.</P>"
          ],
          "links": [],
          "technologies": [
            "AngularJS",
            "Ansible",
            "Bamboo",
            "C++",
            "CUDA",
            "Cassandra",
            "Docker",
            "Eclipselink",
            "Enterprise Architect",
            "GIT",
            "Google Test",
            "Groovy",
            "IntelliJ IDEA",
            "JPA",
            "JUnit",
            "Java",
            "Jira",
            "Maven",
            "Microservices",
            "OpenCL",
            "Oracle DB",
            "Selenium",
            "SonarQube",
            "Spring Data",
            "Spring Documentation",
            "Spring MVC",
            "Spring Security",
            "Swagger",
            "TensorFlow",
            "Valgrind",
            "WebLogic 12",
            "gRPC"
          ]
        },
        {
          "name": "Desarrollo de un sistema de distribución de energía renovable",
          "description": [
            "<P>El cuarto proyecto implica el desarrollo de un sistema de distribución de energía renovable dentro de la red eléctrica, con el objetivo de normalizar y estabilizar el consumo eléctrico a lo largo del tiempo para maximizar la utilización de energías renovables. Desempeñé un papel significativo en este proyecto, contribuyendo extensamente tanto a su arquitectura como a su implementación.</P>",
            "<P>El sistema integra una amplia variedad de tecnologías para lograr sus objetivos. En el núcleo del sistema de comunicación se encuentra un clúster de mensajería basado en Kafka, donde la comunicación con dispositivos se gestiona a través de esquemas Avro. Un \"gateway\" intermediario está implementado utilizando Raspberry Pi, responsable de enviar datos de telemetría y recibir comandos. Este sistema de gateway se desarrolló en Go, utilizando el protocolo de comunicaciones ModBus en sus versiones serial y TCP, con las comunicaciones TCP aseguradas a través de una VPN.</P>",
            "<P>La gestión del software para este proyecto se maneja a través de la plataforma BalenaIO, que facilita el despliegue y operación de los dispositivos gateway. Los procesos de Integración Continua y Despliegue Continuo (CI/CD) se gestionan utilizando CircleCI, asegurando un flujo de trabajo de desarrollo eficiente y sin interrupciones.</P>",
            "<P>Además, creé un analizador de estadísticas en Groovy para la ingesta de datos de telemetría, proporcionando información crítica sobre patrones de consumo de energía y rendimiento del sistema. Mi participación fue fundamental, supervisando la arquitectura, implementación e integración de varios componentes para asegurar el éxito del proyecto.</P>",
            "<P>Mi enfoque práctico y experiencia técnica fueron esenciales para abordar los desafíos de la distribución de energía renovable. Mi contribución al aprovechar tecnologías avanzadas y desarrollar protocolos de comunicación robustos subraya mi papel significativo en este innovador proyecto destinado a mejorar la estabilidad y eficiencia del uso de energía renovable dentro de la red eléctrica.</P>"
          ],
          "links": [],
          "technologies": [
            "Go",
            "Unit Test",
            "BalenaIO",
            "RaspberryPI",
            "Modbus",
            "Python",
            "Makefile",
            "Docker",
            "Kubernetes",
            "GCP",
            "Azure",
            "IoTHub",
            "Kafka",
            "Avro Schemas",
            "Ansible",
            "Elastic Search",
            "Kibana",
            "Makefile",
            "Jira",
            "Groovy"
          ]
        }
      ],
      "images": []
    },
    {
      "name": "Panel Sistemas",
      "title": "Ingeniero Software Senior",
      "short_description": [
        "Panel Sistemas es una empresa especializada en soluciones tecnológicas, ofreciendo servicios de software, consultoría y desarrollo a diversas industrias."
      ],
      "thumbnail": "panel_sistemas.png",
      "period_time": "Septiembre 2015 - Junio 2017",
      "full_description": [
        "<P>Panel Sistemas es una empresa líder en soluciones tecnológicas, especializada en desarrollo de software, consultoría y servicios de TI. Fundada en España, sirve a diversas industrias con clientes destacados como Telefónica, BBVA, Santander, Repsol y El Corte Inglés.</P>",
        "<b>Servicios Ofrecidos</b>",
        "<lu>",
        "<li>Desarrollo de Software: Soluciones de software a medida.</li>",
        "<li>Consultoría: Estrategia y optimización de TI.</li>",
        "<li>Mantenimiento y Soporte: Soporte continuo de aplicaciones.</li>",
        "<li>Aseguramiento de Calidad: Pruebas de software completas.</li>",
        "<li>Transformación Digital: Transición de negocios a plataformas digitales.</li>",
        "</lu>",
        "<b>Experiencia en la Industria</b>",
        "<lu>",
        "<li>Finanzas</li>",
        "<li>Telecomunicaciones</li>",
        "<li>Energía</li>",
        "<li>Retail</li>",
        "</lu>"
      ],
      "contribution": [
        "<P>En Panel Sistemas, trabajé como analista funcional en tres proyectos. Además, realicé tareas como programador senior en la fase posterior a la toma de decisiones. Mis responsabilidades como analista funcional incluyeron lo siguiente:</P>",
        "<ul>",
        "<li>Análisis de requisitos no funcionales y toma de decisiones sobre la implementación exacta de la solución (Redmine)</li>",
        "<li>Creación de sub-tareas con menor granularidad para lograr objetivos (Redmine)</li>",
        "<li>Estimación de tiempos (Redmine)</li>",
        "<li>Definición e implementación de la estructura del proyecto en las tecnologías especificadas</li>",
        "<li>Definición de la cobertura y calidad de las pruebas unitarias (JUnit, Google Test, Valgrind)</li>",
        "<li>Implementación de sistemas CI/CD (Jenkins)</li>",
        "<li>Utilización de SCRUM como metodología de desarrollo</li>",
        "<li>Aplicación de TDD y BDD en el desarrollo de software</li>",
        "<li>Impartición de sesiones de capacitación sobre TDD, BDD, Redes Neuronales, Código Limpio y más</li>",
        "</ul>"
      ],
      "links": [
        {
          "tag": "Sitio web",
          "url": "https://www.panel.es/",
          "text": "Sitio web de Panel Sistemas"
        }
      ],
      "projects": [
        {
          "name": "Modernización de la mensajería de transporte marítimo y aéreo: reemplazo de IATA por XML/JSON",
          "description": [
            "<P>El primero de los proyectos en los que trabajé involucró la implementación de una plataforma de intercambio de mensajes para el transporte marítimo y aéreo. Este proyecto reemplazó con éxito el estándar IATA obsoleto, basado en texto plano y propenso a errores humanos debido a su dependencia de la posición de la cadena de texto, con un formato más moderno, legible y resistente a errores basado en XML/JSON.</P>",
            "<P>Para lograr esto, definí un analizador que traducía mensajes del formato antiguo a cualquiera de los dos estándares modernos a través de una API Restful que cumplía con el modelo de madurez de Richardson Nivel 3. Esta API no solo proporcionó un punto de entrada para la traducción de mensajes, sino que también facilitó la intercomunicación con otras plataformas en todo el mundo y el almacenamiento de estas comunicaciones para asegurar la trazabilidad del tránsito de paquetes a nivel mundial. Los objetivos del proyecto requerían una estructura de alta disponibilidad y un sistema de base de datos replicada basado en MongoDB, implementado a través de un clúster de servidores con cada fragmento replicado.</P>"
          ],
          "links": [],
          "images": [
            "iata.png"
          ],
          "technologies": [
            "Java",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "JPA",
            "Hibernate",
            "Wildfly/JBoss",
            "MongoDB",
            "RabbitMQ",
            "JUnit",
            "JSF",
            "Primefaces",
            "GWT",
            "AWS",
            "Phonegap",
            "Hadoop",
            "Selenium",
            "Maven",
            "GIT",
            "Jenkins",
            "Redmine",
            "IntelliJ IDEA",
            "Docker",
            "Ansible"
          ]
        },
        {
          "name": "Gestión Inteligente de Terminales de Iberdrola con Siemens",
          "description": [
            "El segundo proyecto fue un proyecto conjunto con Siemens para crear la infraestructura de gestión inteligente de terminales de Iberdrola. Estos terminales tomaban información sobre el consumo eléctrico del usuario enviando un informe diario al servidor utilizando el protocolo de comunicación SNMP, a menos que se deseara un monitoreo más detallado de un dispositivo o conjunto de dispositivos específico, en cuyo caso se generarían informes con un nivel de detalle que llegaría al consumo por minuto. Estos datos se almacenaban en una base de datos no relacional MongoDB, que por razones obvias eran varios clústeres, con balanceo de carga y fragmentos replicados. La información de cada punto se almacenaba en el clúster por proximidad geográfica, siempre que el servidor pudiera asumir el volumen de datos que incluía la inclusión de dicho nodo. La información de cada nodo se mantenía durante un año con un nivel de detalle de consumo por minuto, después de un año se compactaba generando el máximo, mínimo y promedio de cada día y esta información se mantenía a este nivel de detalle durante 5 años y pasado ese lapso de tiempo la información de cada nodo se compactaba nuevamente. El sistema también daba la posibilidad de controlar y escuchar en tiempo real el dispositivo a través del protocolo SNMP y JNLP. Esta estructura se creó utilizando microservicios en C++ con el framework de llamada a procedimiento remoto gRPC y se implementó en un conjunto de servidores basados en Red Hat Enterprise Linux."
          ],
          "links": [],
          "images": [
            "iberdrola.svg",
            "siemens.png"
          ],
          "technologies": [
            "C++",
            "Google Test",
            "Valgrind",
            "cLion",
            "Boost",
            "gRPC",
            "Microservices",
            "Java",
            "RabbitMQ",
            "JPA",
            "Hibernate",
            "Apache Tomcat",
            "MongoDB",
            "JUnit",
            "JSF",
            "Primefaces",
            "Hadoop",
            "Maven",
            "GIT",
            "Jenkins",
            "Jira",
            "IntelliJ IDEA",
            "Docker",
            "Ansible",
            "Kubernetes",
            "JNLP",
            "SNMP",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "Spring IOT"
          ]
        },
        {
          "name": "Sistema de monitoreo y cuidado para personas con discapacidades o ancianos para Securitas Direct",
          "description": [
            "<P>El tercer proyecto, ejecutado para Securitas Direct, implicó la creación de un sistema integral de monitoreo y cuidado para personas con discapacidades o ancianos. El sistema identificaba el estado del usuario basándose en diversos sensores distribuidos por su hogar, incluidos sensores de presencia, sensores de apertura de puertas y sensores personales de caídas. Estos datos se recopilaban para proporcionar información detallada sobre las actividades del usuario, que no solo se almacenaba y estaba accesible para consulta, sino que también era capaz de generar alarmas basadas en los patrones típicos de comportamiento del individuo. El sistema analizaba estos patrones y alertaba si se detectaban cambios repentinos, con configuraciones de alarma personalizables.</P>",
            "<P>Además, la aplicación incluía un componente móvil desarrollado como una aplicación híbrida. Esta versión móvil utilizaba sensores para identificar caídas, rastrear la posición GPS del individuo y más.</P>"
          ],
          "links": [],
          "technologies": [
            "C++",
            "Google Test",
            "Valgrind",
            "cLion",
            "Boost",
            "gRPC",
            "Microservices",
            "Java",
            "AWS",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "Spring IoC",
            "Spring Batch",
            "RabbitMQ",
            "JPA",
            "Hibernate",
            "Apache Tomcat",
            "Oracle DB",
            "JUnit",
            "Ionic",
            "Typescript",
            "Hadoop",
            "Selenium",
            "Jasmine",
            "Maven",
            "GIT",
            "Jenkins",
            "Jira",
            "Confluence",
            "IntelliJ IDEA",
            "Docker",
            "Ansible",
            "Kubernetes"
          ]
        }
      ],
      "images": []
    },
    {
      "name": "Grupo Prisa",
      "title": "Ingeniero Software Senior",
      "short_description": [
        "Grupo PRISA es un conglomerado de medios español, conocido por sus influyentes periódicos, emisoras de radio y publicaciones educativas."
      ],
      "thumbnail": "prisa.png",
      "period_time": "Marzo 2012 - Mayo 2015",
      "full_description": [
        "<p>Grupo PRISA, formalmente conocido como Promotora de Informaciones, S.A., es un destacado conglomerado de medios español con una significativa influencia en el mundo hispanohablante. Fundado en 1972 por Jesús de Polanco, PRISA ha crecido hasta convertirse en una de las mayores empresas de medios en España y América Latina, abarcando una amplia gama de medios, incluyendo periódicos, emisoras de radio, canales de televisión y publicaciones educativas.</p>",
        "<p>Aspectos clave de Grupo PRISA incluyen:</p>",
        "<ul>",
        "<li><strong>Periódicos:</strong> El periódico insignia de PRISA es <em>El País</em>, uno de los diarios más leídos y respetados de España. Lanzado en 1976 durante la transición democrática de España, <em>El País</em> rápidamente se convirtió en un símbolo de la nueva era democrática, ofreciendo periodismo de alta calidad y una postura editorial progresista. El periódico cubre una amplia gama de temas, desde noticias nacionales e internacionales hasta cultura, economía y deportes. También ha expandido su alcance con una robusta presencia en línea, atendiendo a millones de lectores en todo el mundo.</li>",
        "<li><strong>Radio:</strong> En el sector de la radio, PRISA posee Cadena SER, la red de radio líder en España. Cadena SER es conocida por su programación informativa, programas de tertulia y cobertura deportiva. Tiene una sustancial audiencia y es conocida por su completa cobertura de noticias y programas de tertulia que abordan asuntos de actualidad, política y problemas sociales. Otras emisoras destacadas bajo el paraguas de PRISA incluyen Los 40 Principales, una popular emisora de música que toca éxitos contemporáneos, y Cadena Dial, que se enfoca en música en español.</li>",
        "<li><strong>Televisión:</strong> PRISA también ha incursionado en la televisión, con su canal <em>CNN+</em> habiendo sido un jugador significativo en el mercado de noticias español hasta su cierre en 2010. A pesar de esto, PRISA sigue teniendo presencia en el sector televisivo a través de diversas asociaciones y producción de contenidos.</li>",
        "<li><strong>Publicaciones Educativas:</strong> Más allá de las noticias y el entretenimiento, PRISA es un jugador importante en la industria de publicaciones educativas a través de su subsidiaria, Santillana. Fundada en 1960, Santillana es una editorial líder de materiales educativos en España y América Latina. Ofrece una amplia gama de libros de texto, contenido digital y recursos educativos para estudiantes y profesores, haciendo contribuciones significativas a la educación en el mundo hispanohablante.</li>",
        "<li><strong>Transformación Digital:</strong> En los últimos años, PRISA ha adoptado la transformación digital, adaptándose al cambiante panorama de los medios. La empresa ha invertido fuertemente en plataformas digitales, aplicaciones móviles y contenido en línea para alcanzar a una audiencia más amplia y mantenerse relevante en la era digital. <em>El País</em>, por ejemplo, tiene una fuerte presencia digital, con un sitio web que atrae a millones de visitantes cada mes y una variedad de contenido multimedia, incluyendo videos, podcasts y características interactivas.</li>",
        "<li><strong>Influencia Global:</strong> La influencia de PRISA se extiende más allá de España y América Latina. Ha formado asociaciones estratégicas con empresas de medios internacionales y ha expandido su alcance a otras regiones. El contenido de la empresa es consumido por millones de personas en todo el mundo, convirtiéndolo en un puente cultural e informativo significativo entre España, América Latina y el resto del mundo.</li>",
        "</ul>"
      ],
      "contribution": [
        "<p>Tengo una amplia experiencia trabajando como programador senior remoto en tres proyectos importantes. En este rol, se me confió una variedad de responsabilidades críticas que requerían tanto experiencia técnica como fuertes habilidades de comunicación. Uno de mis deberes principales fue asistir a reuniones con el propietario del producto para definir los requisitos detallados del proyecto. Esto implicaba un análisis exhaustivo de los objetivos del proyecto y desglosarlos en tareas específicas y procesables. Al hacerlo, aseguré que todos los aspectos del proyecto fueran claramente entendidos y abordados desde el principio.</p>",
        "<p>La coordinación con equipos externos fue otro aspecto importante de mi rol. Trabajé en estrecha colaboración con equipos de colaboración con sede en América del Sur, India y China. Esta coordinación internacional requería que gestionara eficazmente diferentes zonas horarias y diferencias culturales. Para facilitar una comunicación y colaboración fluidas, traduje e interpreté los requisitos en chino. Esta habilidad lingüística fue crucial para superar las brechas de comunicación y asegurar que todos los miembros del equipo, independientemente de su ubicación, tuvieran una comprensión clara y precisa de los requisitos del proyecto.</p>",
        "<p>La innovación y la eficiencia fueron áreas clave de enfoque en mi rol. Participé en sesiones de lluvia de ideas para desarrollar e implementar nuevas herramientas destinadas a mejorar la automatización y la productividad del equipo. Estas herramientas estaban diseñadas para agilizar los flujos de trabajo, reducir el esfuerzo manual y mejorar la eficiencia general del proceso de desarrollo. Al introducir estas innovaciones, pude contribuir a un entorno de equipo más productivo y efectivo.</p>",
        "<p>La planificación detallada del proyecto fue otra responsabilidad crítica. Utilicé la metodología SCRUM para asegurar que todas las tareas estuvieran organizadas y gestionadas eficazmente a lo largo del ciclo de vida del proyecto. Esto implicaba crear planes detallados, establecer cronogramas realistas y monitorear continuamente el progreso para asegurar que se cumplieran los hitos del proyecto. El uso de SCRUM permitió un enfoque flexible e iterativo para la gestión de proyectos, permitiendo que el equipo se adaptara a los cambios y abordara los desafíos de manera rápida.</p>",
        "<p>En general, mi experiencia como programador senior remoto me ha dotado de un conjunto de habilidades diverso y una profunda comprensión de la gestión efectiva de proyectos en un entorno de trabajo remoto y global. Mi capacidad para definir requisitos detallados, coordinar con equipos internacionales, innovar para mejorar la productividad y gestionar proyectos utilizando SCRUM me ha permitido contribuir significativamente al éxito de los proyectos en los que he estado involucrado.</p>"
      ],
      "links": [
        {
          "tag": "Sitio web",
          "url": "https://www.prisa.com/es",
          "text": "Sitio web de Grupo Prisa"
        }
      ],
      "projects": [
        {
          "name": "Aplicación de visor de paquetes educativos",
          "description": [
            "<p>El primer proyecto implicó el desarrollo de una aplicación integral para plataformas Android e iOS destinada a la visualización de paquetes educativos. Esta aplicación fue meticulosamente diseñada para ser compatible con dispositivos de gama baja, asegurando que pudiera alcanzar una base de usuarios más amplia sin comprometer el rendimiento. Era esencial que la aplicación interactuara fluidamente con los usuarios, proporcionando una experiencia sin interrupciones y atractiva. Además, la aplicación estaba equipada con funcionalidad para rastrear y enviar el progreso de los usuarios al servidor, facilitando un monitoreo y evaluación efectivos de su viaje de aprendizaje.</p>",
            "<p>Una característica clave de la aplicación fue su capacidad para manejar paquetes educativos que cumplieran con el estándar SCORM (Modelo de Referencia de Objetos de Contenido Compartible), que se utiliza ampliamente en el campo del e-learning para crear y entregar contenido de aprendizaje interactivo y adaptativo. Para asegurar la compatibilidad con versiones anteriores, la aplicación también fue diseñada para soportar versiones antiguas de paquetes educativos. Esta doble compatibilidad aseguraba que los usuarios pudieran acceder a una amplia gama de contenido educativo, tanto moderno como antiguo, mejorando así la utilidad y el atractivo de la aplicación en varios contextos educativos.</p>"
          ],
          "links": [],
          "technologies": [
            "Java",
            "Android Studio",
            "XCode",
            "Objective-C",
            "Dagger",
            "SCORM",
            "HTML",
            "JavaScript",
            "Bootstrap",
            "jQuery",
            "Jira",
            "GIT",
            "Confluence"
          ]
        },
        {
          "name": "Proyecto de estandarización de paquetes educativos",
          "description": [
            "<p>El segundo proyecto surgió de la necesidad de estandarizar los paquetes educativos. En un esfuerzo por ahorrar costos asociados con la migración de Flash a HTML5 bajo el estándar SCORM, se tomó la decisión de desarrollar una herramienta de traducción de Flash a HTML5. Esta herramienta facilitó la conversión de contenido educativo de Flash a HTML5, asegurando la compatibilidad con el estándar SCORM. Al mantener una biblioteca centralizada, la herramienta permitió que cualquier actualización al sistema central se aplicara de manera fluida a todos los paquetes creados anteriormente. Este enfoque agilizó significativamente el proceso de actualización, asegurando consistencia y reduciendo la necesidad de ajustes manuales repetitivos.</p>",
            "<p>Antes de aceptar una nueva versión de la biblioteca centralizada, se realizaron pruebas exhaustivas en un entorno virtualizado. Utilizando tecnologías como QEmu, KVM y Xen, las nuevas versiones fueron evaluadas rigurosamente para asegurar su estabilidad y funcionalidad. Este proceso de prueba integral fue crucial para identificar y resolver posibles problemas antes del despliegue, manteniendo así la integridad de los paquetes educativos. El proyecto no solo logró ahorros de costos y mejoró la eficiencia, sino que también proporcionó un marco robusto para futuras actualizaciones y mejoras, asegurando la longevidad y adaptabilidad del contenido educativo.</p>"
          ],
          "links": [],
          "technologies": [
            "C++",
            "Linux",
            "Flash",
            "HTML",
            "JavaScript",
            "AngularJS",
            "Bootstrap",
            "SCORM",
            "jQuery",
            "Jira",
            "GIT",
            "Confluence",
            "QEmu",
            "KVM",
            "Xen",
            "Bash",
            "NginX",
            "Valgrind"
          ]
        },
        {
          "name": "Proyecto de plataforma educativa",
          "description": [
            "<p>El tercer proyecto se desarrolló utilizando C# en la plataforma .NET, diseñado como un entorno integral para profesores y profesionales de la educación. Esta plataforma permitía a los usuarios gestionar diversas tareas educativas, incluyendo la gestión de estudiantes, el manejo de paquetes educativos y el análisis de sus resultados. También facilitaba la programación y ejecución de tareas relacionadas con el servidor de medios para fines de transmisión.</p>",
            "<p>Además, la plataforma contaba con un centro de comunicación de audio y video de alta resolución vía IP, mejorando las interacciones en tiempo real entre educadores y estudiantes. Este sistema robusto soportaba un flujo de trabajo sin interrupciones y eficiente, asegurando que todas las actividades educativas se gestionaran y ejecutaran efectivamente dentro de un entorno unificado.</p>"
          ],
          "links": [],
          "technologies": [
            "C#",
            ".NET",
            "IIS",
            "Windows Server",
            "Microsoft SQL Server",
            "Jira",
            "GIT",
            "Confluence"
          ]
        }
      ],
      "images": []
    },
    {
      "name": "Intelygenz",
      "title": "Ingeniero Software Senior",
      "short_description": [
        "Intelygenz es una empresa de tecnología especializada en inteligencia artificial, aprendizaje automático y soluciones de software a medida para diversas industrias."
      ],
      "thumbnail": "intelygenz.png",
      "period_time": "Enero 2010 - Enero 2012",
      "full_description": [
        "<p>El tercer proyecto se desarrolló utilizando C# en la plataforma .NET, diseñado como un entorno integral para profesores y profesionales de la educación. Esta plataforma permitía a los usuarios gestionar diversas tareas educativas, incluyendo la gestión de estudiantes, el manejo de paquetes educativos y el análisis de sus resultados. También facilitaba la programación y ejecución de tareas relacionadas con el servidor de medios para fines de transmisión.</p>",
        "<p>Además, la plataforma contaba con un centro de comunicación de audio y video de alta resolución vía IP, mejorando las interacciones en tiempo real entre educadores y estudiantes. Este sistema robusto soportaba un flujo de trabajo sin interrupciones y eficiente, asegurando que todas las actividades educativas se gestionaran y ejecutaran efectivamente dentro de un entorno unificado.</p>"
      ],
      "contribution": [
        "<p>Como Programador Senior, contribuí a tres proyectos significativos. El primer proyecto fue una aplicación para Antena 3 Televisión, desarrollada de forma nativa para Android. Esta aplicación servía como una interfaz interactiva en tiempo real con el contenido televisivo, actualizada a través de marcadores inaudibles incrustados en el audio. El audio era interceptado por la aplicación, utilizando una solución personalizada desarrollada en el NDK de Android para asegurar un alto rendimiento y bajo consumo de batería. Esta solución modificaba el audio añadiendo ecos separados por distancias temporales específicas, que se interpretaban de manera binaria.</p>"
      ],
      "links": [
        {
          "tag": "Sitio web",
          "url": "https://intelygenz.com/",
          "text": "Sitio web de Intelygenz"
        }
      ],
      "projects": [
        {
          "name": "Proyecto de Antena 3 Televisión",
          "description": [
            "<p>El primer proyecto involucró el desarrollo de una aplicación para Antena 3 Televisión, construida de forma nativa para Android. Esta aplicación servía como una interfaz interactiva en tiempo real con el contenido televisivo, actualizada dinámicamente utilizando marcadores inaudibles incrustados en el audio. Para lograr esto, la aplicación utilizaba una solución personalizada desarrollada en el NDK de Android, que aseguraba un mayor rendimiento y menor consumo de batería.</p>",
            "<p>El audio modificado incluía ecos separados por intervalos temporales específicos, que la aplicación interpretaba en formato binario. Este enfoque innovador permitía que la aplicación interactuara sin problemas con la transmisión televisiva, proporcionando a los usuarios una experiencia de visualización mejorada y atractiva.</p>"
          ],
          "links": [
            {
              "tag": "Documentación",
              "url": "https://www.atresmediacorporacion.com/a3document/2012/05/24/DOCUMENTS/00012/00012.pdf",
              "text": "Documentación de la aplicación de Antena 3 TV"
            }
          ],
          "images": [
            "intelygenz_01.jpeg"
          ],
          "technologies": [
            "Java",
            "Android Studio",
            "Android NDK",
            "Jira",
            "GIT",
            "Confluence"
          ]
        },
        {
          "name": "Proyecto de gestor de documentos para BBVA",
          "description": [
            "<p>El segundo proyecto involucró el desarrollo de un gestor de documentos para el banco BBVA, implementado en C# dentro del entorno .NET. Este sistema fue diseñado para conectarse con herramientas externas basadas en el framework Google App Engine. Especializado en documentos financieros, el gestor de documentos facilitaba la creación de grupos de edición, supervisión y acreditación, asegurando una gestión completa de varias tareas relacionadas con los documentos.</p>",
            "<p>Además, el gestor de documentos integraba el flujo de trabajo y la lógica de negocio de BBVA, permitiendo una interacción fluida con otras entidades bancarias. Esta implementación no solo agilizó los procesos de manejo de documentos, sino que también aseguró que las operaciones del banco estuvieran alineadas con los estándares y mejores prácticas de la industria, mejorando así la eficiencia y colaboración entre diferentes departamentos y socios externos.</p>"
          ],
          "links": [],
          "images": [
            "bbva.jpg"
          ],
          "technologies": [
            "C#",
            ".NET",
            "IIS",
            "Windows Server",
            "Microsoft SQL Server",
            "Cassandra",
            "HTML",
            "JavaScript",
            "Bootstrap",
            "jQuery",
            "Jira",
            "GIT",
            "Confluence"
          ]
        },
        {
          "name": "Proyecto de Front colaborativo",
          "description": [
            "<p>El tercer proyecto involucró el desarrollo de un front-end colaborativo para el banco BBVA, utilizando tanto Java como JavaScript. Este proyecto se integró con el entorno NACAR, una plataforma diseñada para mejorar la funcionalidad y experiencia del usuario de aplicaciones bancarias. La integración con NACAR permitió el desarrollo de características avanzadas y una interacción fluida dentro del sistema bancario.</p>",
            "<p>Un logro significativo de este proyecto fue la creación de una biblioteca de gestos y acciones en pantalla, conocida como IRIS. Esta biblioteca fue diseñada para mejorar la interacción del usuario proporcionando formas intuitivas y eficientes de realizar varias tareas. La biblioteca IRIS mejoró la experiencia general del usuario, haciendo que la aplicación fuera más receptiva y fácil de usar.</p>"
          ],
          "links": [],
          "images": [
            "bbva.jpg"
          ],
          "technologies": [
            "Java",
            "Spring Security",
            "Spring MVC",
            "Spring Data",
            "Spring Documentation",
            "JPA",
            "Hibernate",
            "Websphere",
            "Oracle DB",
            "JUnit",
            "JSF",
            "Maven",
            "GIT",
            "Jira",
            "Confluence",
            "GIT",
            "Eclipse"
          ]
        }
      ],
      "images": []
    },
    {
      "name": "UAH",
      "title": "Investigador y personal docente",
      "short_description": [
        "La Universidad de Alcalá de Henares es una prestigiosa institución española conocida por su rica historia y diversos programas académicos."
      ],
      "thumbnail": "uah.svg",
      "period_time": "Enero 2006 - Enero 2009",
      "full_description": [
        "<p>La Universidad de Alcalá de Henares, comúnmente conocida como la Universidad de Alcalá, es una reconocida universidad pública ubicada en Alcalá de Henares, una ciudad histórica cerca de Madrid, España. Fundada en 1499 por el Cardenal Cisneros, es una de las universidades más antiguas de España y tiene una rica herencia que combina tradición con modernidad.</p>",
        "<p>La Universidad de Alcalá es celebrada por su compromiso con la excelencia académica y la innovación. Ofrece una amplia gama de programas de pregrado, posgrado y doctorado en diversos campos de estudio, incluyendo humanidades, ciencias sociales, ciencias naturales, ingeniería, ciencias de la salud y derecho. La universidad es particularmente conocida por sus sólidos programas en literatura, lingüística y estudios de la lengua española, atrayendo a estudiantes y académicos de todo el mundo.</p>",
        "<p>Una de las características más notables de la universidad es su campus histórico, que es un sitio del Patrimonio Mundial de la UNESCO. El campus incluye impresionantes ejemplos de arquitectura renacentista española, como el Colegio de San Ildefonso, el edificio principal de la universidad, que cuenta con un hermoso patio y una capilla histórica. El compromiso de la universidad con la preservación de su patrimonio histórico y cultural es evidente en el mantenimiento y restauración cuidadosa de estos tesoros arquitectónicos.</p>",
        "<p>Además de su campus histórico, la Universidad de Alcalá cuenta con instalaciones modernas equipadas con la última tecnología para apoyar la investigación de vanguardia y métodos de enseñanza innovadores. Las bibliotecas, laboratorios y centros de investigación de la universidad proporcionan a los estudiantes y profesores los recursos que necesitan para perseguir sus metas académicas y profesionales. La universidad también promueve una fuerte cultura de investigación y fomenta la colaboración con instituciones e industrias tanto a nivel nacional como internacional.</p>",
        "<p>La Universidad de Alcalá está dedicada a fomentar una comunidad diversa e inclusiva. Da la bienvenida a estudiantes de todo el mundo y ofrece una gama de servicios de apoyo para ayudar a los estudiantes internacionales a integrarse en la vida del campus. La vibrante vida estudiantil de la universidad incluye numerosas actividades culturales, sociales y deportivas, proporcionando a los estudiantes oportunidades para interactuar con la comunidad en general y desarrollar sus habilidades personales y profesionales.</p>",
        "<p>Un aspecto clave de la misión de la Universidad de Alcalá es su compromiso con la responsabilidad social y el desarrollo sostenible. La universidad participa activamente en iniciativas que promueven la sostenibilidad ambiental, la justicia social y el desarrollo comunitario. Colabora con organizaciones locales, nacionales e internacionales para abordar desafíos globales urgentes y contribuir al bienestar de la sociedad.</p>",
        "<p>La red de exalumnos de la Universidad de Alcalá es un testimonio de su impacto e influencia. Los graduados de la universidad han alcanzado un éxito significativo en diversos campos, incluyendo la academia, los negocios, el gobierno y las artes. La universidad mantiene fuertes conexiones con sus exalumnos, fomentando una comunidad de apoyo y comprometida que sigue contribuyendo al legado de la universidad.</p>",
        "<p>En resumen, la Universidad de Alcalá de Henares es una institución distinguida que combina una importancia histórica con un enfoque progresista hacia la educación. Su dedicación a la excelencia académica, la preservación cultural, la innovación en la investigación y la responsabilidad social la convierte en una universidad líder en España y un nombre respetado en la educación superior global.</p>"
      ],
      "contribution": [
        "<p>Mi rol como investigador en la universidad fue dentro del grupo de investigación TIFyC, donde tuve una gama de responsabilidades enfocadas en avanzar en el campo de la tecnología y la inteligencia artificial. Una de mis principales tareas fue realizar investigaciones exhaustivas sobre el estado del arte en diversas áreas, incluyendo problemas de accesibilidad, algoritmos de IA, visión artificial y sistemas biométricos. Esto implicaba mantenerse actualizado con los últimos avances, evaluar nuevas metodologías e identificar posibles áreas de innovación.</p>",
        "<p>Además de mis deberes de investigación, participé activamente en colaboraciones con grupos de investigación de diferentes universidades. Estas colaboraciones tenían como objetivo fomentar el intercambio de conocimientos, promover la investigación interdisciplinaria e impulsar proyectos innovadores. Al trabajar estrechamente con otros investigadores, pudimos combinar nuestra experiencia y recursos para abordar desafíos complejos y expandir los límites de nuestros respectivos campos.</p>",
        "<p>Otro aspecto clave de mi rol fue la preparación de informes detallados sobre nuestros hallazgos de investigación. Estos informes documentaban nuestras metodologías, resultados y conclusiones, proporcionando un recurso valioso para investigaciones futuras y contribuyendo a la comunidad científica en general. Mi capacidad para comunicar claramente y de manera efectiva nuestros hallazgos fue crucial para asegurar que nuestro trabajo tuviera un impacto significativo.</p>",
        "<p>Además, participé en el estudio y la solicitud de ayudas estatales y subvenciones para proyectos de investigación y desarrollo (I+D). Esto requería una comprensión exhaustiva del panorama de financiación y la capacidad de elaborar propuestas convincentes que demostraran la importancia y el impacto potencial de nuestra investigación. Obtener estos fondos fue esencial para apoyar nuestros proyectos en curso y permitir nuevas iniciativas.</p>",
        "<p>Como parte de mis responsabilidades, también serví como profesor asistente, enseñando cursos sobre Inteligencia Artificial y Sistemas de Visión Artificial. En esta capacidad, fui responsable de impartir conocimientos a los estudiantes, diseñar materiales del curso y guiarlos a través de conceptos complejos y aplicaciones prácticas. Mi rol de enseñanza me permitió compartir mi pasión por la IA y la visión artificial con la próxima generación de investigadores y profesionales, al mismo tiempo que me mantenía comprometido con la comunidad académica.</p>"
      ],
      "links": [
        {
          "tag": "Sitio web",
          "url": "https://uah.es/",
          "text": "Sitio web de la Universidad de Alcalá"
        }
      ],
      "projects": [
        {
          "name": "Proyecto del grupo de investigación",
          "description": [
            "<p>Uno de los proyectos significativos llevados a cabo por nuestro grupo de investigación se centró en investigar dispositivos innovadores diseñados para mejorar la interacción para individuos con discapacidades visuales, auditivas o motoras. El objetivo principal de esta investigación era desarrollar y perfeccionar tecnologías que pudieran facilitar interacciones más intuitivas y accesibles con varios tipos de sistemas, incluidos computadoras de escritorio, portátiles y dispositivos móviles.</p>",
            "<p>Nuestro equipo exploró una amplia gama de tecnologías de asistencia y mejoras de interfaces de usuario destinadas a superar los desafíos que enfrentan las personas con discapacidades. Esto incluyó el desarrollo de dispositivos de entrada especializados, soluciones de software adaptativas y diseños avanzados de interfaces de usuario que se adaptaran específicamente a las necesidades de los usuarios con discapacidades visuales, auditivas y motoras. Al enfocarnos en estas áreas, buscábamos crear un entorno digital más inclusivo que empoderara a los usuarios para interactuar con la tecnología de manera más efectiva e independiente.</p>",
            "<p>La investigación también involucró extensas pruebas de usuario y colaboración con individuos que tienen discapacidades para asegurar que las soluciones desarrolladas fueran prácticas, fáciles de usar y realmente beneficiosas. Al integrar comentarios de usuarios reales, nuestro grupo de investigación pudo hacer avances significativos en la creación de dispositivos y aplicaciones que no solo cumplieran con los estándares de accesibilidad, sino que también mejoraran la experiencia general del usuario para personas con discapacidades.</p>",
            "<p>Este proyecto ejemplifica nuestro compromiso de aprovechar la tecnología para eliminar barreras y mejorar la calidad de vida de las personas con discapacidades, haciendo que la tecnología sea accesible y usable para todos, independientemente de sus capacidades físicas.</p>"
          ],
          "links": [],
          "images": [
            "tifyc.jpg"
          ],
          "technologies": [
            "Java",
            "Android Studio",
            "Android",
            "Linux",
            "C++",
            "Anjuta",
            "Qt",
            "PIC",
            "Arduino",
            "SVN",
            "C#",
            ".NET",
            "Mono"
          ]
        },
        {
          "name": "Sistema de comunicación para dispositivos biométricos",
          "description": [
            "<p>El segundo proyecto en el que trabajé implicó desarrollar un sistema de comunicación estandarizado para dispositivos biométricos. El objetivo era habilitar un intercambio de mensajes y colaboración sin problemas entre dispositivos de varios fabricantes. Para lograr esto, integramos un sistema de llamadas a procedimientos remotos (RPC) dentro de los propios dispositivos. Este sistema RPC aseguraba que la comunicación entre los dispositivos permaneciera transparente, independientemente del lenguaje de programación o sistema operativo utilizado.</p>",
            "<p>El proyecto requería una consideración cuidadosa de los problemas de interoperabilidad, ya que los dispositivos biométricos a menudo vienen con protocolos de comunicación propietarios y especificaciones técnicas diversas. Al implementar un sistema RPC estandarizado, pudimos abstraer las diferencias subyacentes y crear un protocolo de comunicación unificado. Este protocolo facilitaba un intercambio eficiente de datos y una coordinación operativa en una amplia gama de dispositivos biométricos.</p>",
            "<p>Además, el sistema de comunicación fue diseñado para ser altamente robusto y seguro, dado el carácter sensible de los datos biométricos. Incorporamos mecanismos de encriptación y autenticación para proteger la integridad de los datos y prevenir el acceso no autorizado. El resultado final fue una solución confiable y multiplataforma que mejoró considerablemente la interoperabilidad y funcionalidad de los sistemas biométricos.</p>",
            "<p>Este proyecto no solo mejoró la compatibilidad de los dispositivos, sino que también allanó el camino para futuros avances en tecnología biométrica, permitiendo a los fabricantes centrarse en la innovación sin preocuparse por las barreras de comunicación. El sistema de comunicación estandarizado representó así un avance significativo en el campo de la integración de dispositivos biométricos.</p>"
          ],
          "links": [],
          "technologies": [
            "Java",
            "Linux",
            "C++",
            "Anjuta",
            "SVN",
            "C#",
            ".NET",
            "Mono"
          ]
        },
        {
          "name": "Proyecto de página web del grupo de investigación",
          "description": [
            "<p>El tercer proyecto involucró la creación y el mantenimiento continuo de la página web del grupo de investigación utilizando el Sistema de Gestión de Contenidos (CMS) Joomla. Este proyecto requería no solo el desarrollo inicial de una página web fácil de usar y visualmente atractiva, sino también la actualización y mejora continuas de sus características y contenido para satisfacer las necesidades en evolución del grupo de investigación.</p>",
            "<p>El sitio web servía como un centro central para las actividades del grupo de investigación, proporcionando acceso a publicaciones, actualizaciones de proyectos y eventos futuros. Aprovechando el robusto framework de Joomla, aseguré que el sitio web fuera tanto seguro como escalable, capaz de manejar un volumen creciente de contenido e interacciones de usuarios. El CMS permitía una gestión de contenido fácil, habilitando a los miembros del grupo de investigación a contribuir y actualizar información sin requerir conocimientos técnicos extensos.</p>",
            "<p>Además de la implementación técnica, me enfoqué en optimizar el rendimiento y la accesibilidad del sitio web. Esto incluía asegurar tiempos de carga rápidos, implementar un diseño responsivo para la compatibilidad con varios dispositivos y adherirse a los estándares de accesibilidad para hacer que el sitio fuera usable para todos los visitantes. Las tareas de mantenimiento regular incluían actualizar el núcleo de Joomla y las extensiones, monitorear el rendimiento del sitio y abordar cualquier vulnerabilidad de seguridad de manera oportuna.</p>",
            "<p>En resumen, este proyecto demostró mi capacidad para desarrollar y gestionar una presencia web dinámica que respalda efectivamente los objetivos y actividades de un grupo especializado, utilizando las potentes características del CMS Joomla.</p>"
          ],
          "links": [],
          "images": [
            "tifyc.jpg"
          ],
          "technologies": [
            "Java",
            "Linux",
            "C++",
            "Anjuta",
            "SVN",
            "C#",
            ".NET",
            "Mono"
          ]
        },
        {
          "name": "Contribuciones al grupo de investigación",
          "description": [
            "<p>Durante mi permanencia en el grupo de investigación, contribuí en diversas capacidades. Mi trabajo de apoyo abarcó una variedad de tareas destinadas a facilitar los objetivos del grupo. También organicé y conduje seminarios especializados enfocados en la Robótica, compartiendo conocimientos avanzados y los últimos desarrollos en el campo con mis colegas y estudiantes.</p>",
            "<p>Además, serví como profesor asistente, donde enseñé asignaturas como Inteligencia Artificial y Visión Artificial. En este rol, fui responsable de preparar y dictar conferencias, asistir en el diseño del curso y brindar orientación a los estudiantes sobre temas complejos relacionados con las tecnologías de IA y visión por computadora. Mi participación en estas asignaturas ayudó a cerrar la brecha entre los conceptos teóricos y las aplicaciones prácticas para los estudiantes.</p>",
            "<p>Más allá de los roles de enseñanza y apoyo, participé activamente en actividades extracurriculares, incluyendo el concurso de robótica Hispabot. Competí en el modo de resolución de laberintos, donde apliqué mi experiencia en robótica e IA para diseñar y programar robots capaces de navegar y resolver laberintos. Esta experiencia no solo mejoró mis habilidades técnicas, sino que también demostró mi capacidad para aplicar la investigación en entornos competitivos del mundo real.</p>"
          ],
          "links": [],
          "images": [
            "hispabot.jpeg"
          ],
          "technologies": [
            "C",
            "C++",
            "Arduino",
            "PIC",
            "Mathlab",
            "Octave",
            "Java",
            "Python"
          ]
        }
      ],
      "images": []
    },
    {
      "name": "Knowcentury",
      "title": "Programador junior",
      "short_description": [
        "Pequeña empresa dedicada a la creación de páginas web"
      ],
      "thumbnail": "knowcentury.png",
      "period_time": "Enero 2005 - Julio 2005",
      "full_description": [
        "Pequeña empresa dedicada a la creación de páginas web"
      ],
      "contribution": [
        "<p>Durante mis primeros años en la universidad, con el fin de poder pagar mis estudios, trabajé como programador web junior utilizando CMS en Knowcentury.</p>"
      ],
      "links": [],
      "projects": [
        {
          "name": "Desarrollo de sitios web",
          "description": [
            "<p>Implementación de páginas web utilizando CMS como Joomla, Drupal y Moodle.</p>"
          ],
          "links": [],
          "technologies": [
            "Joomla",
            "PHP",
            "JavaScript",
            "MySQL",
            "HTML"
          ]
        }
      ],
      "images": []
    },
    {
      "name": "IBM",
      "title": "Programador junior",
      "short_description": [
        "IBM, una empresa tecnológica global, se especializa en computación en la nube, IA y hardware, proporcionando soluciones innovadoras para negocios en todo el mundo."
      ],
      "thumbnail": "ibm.svg",
      "period_time": "Septiembre 2003 - Diciembre 2004",
      "full_description": [
        "<p>IBM, o International Business Machines Corporation, es una empresa tecnológica de renombre mundial con una rica historia que abarca más de un siglo. Fundada en 1911 y con sede en Armonk, Nueva York, IBM ha estado constantemente a la vanguardia de la innovación tecnológica, influyendo en numerosos sectores con sus soluciones pioneras. Hoy en día, IBM es un líder en computación en la nube, inteligencia artificial (IA) y hardware empresarial, ofreciendo una suite completa de productos y servicios que atienden a negocios de todos los tamaños.</p>",
        "<p>Una de las contribuciones más significativas de IBM a la tecnología es su desarrollo de potentes sistemas de IA, particularmente la plataforma IBM Watson. Watson está diseñado para aprovechar el procesamiento del lenguaje natural y el aprendizaje automático para analizar grandes cantidades de datos, proporcionando información y habilitando la automatización en diversas industrias, incluyendo salud, finanzas y servicio al cliente. Las capacidades de IBM Watson en análisis de datos y análisis predictivo ayudan a las organizaciones a tomar decisiones más informadas, mejorar la eficiencia operativa e impulsar la innovación.</p>",
        "<p>Además de la IA, IBM ha hecho avances sustanciales en computación en la nube con su plataforma IBM Cloud. Esta robusta plataforma ofrece una amplia gama de servicios en la nube, incluyendo infraestructura como servicio (IaaS), plataforma como servicio (PaaS) y software como servicio (SaaS). IBM Cloud está diseñado para soportar tanto entornos de nube pública como privada, permitiendo a las empresas desplegar y gestionar aplicaciones con mayor flexibilidad y seguridad. Las capacidades de integración de la plataforma permiten una conectividad perfecta con los sistemas existentes, facilitando la transformación digital y la innovación.</p>",
        "<p>Las soluciones de hardware de IBM también han jugado un papel fundamental en el éxito de la empresa. La serie de mainframes IBM Z, por ejemplo, son conocidos por su fiabilidad, seguridad y rendimiento, particularmente en industrias que requieren capacidades robustas de procesamiento de datos, como la banca y las finanzas. Estos mainframes están diseñados para manejar el procesamiento de transacciones a gran escala y la gestión de datos, asegurando la continuidad del negocio y la eficiencia operativa.</p>",
        "<p>Otra área clave de la experiencia de IBM es su compromiso con la investigación y el desarrollo (I+D). IBM invierte fuertemente en I+D, empujando constantemente los límites de lo que es posible en tecnología. Las innovaciones de la empresa han llevado a numerosos avances, incluyendo el desarrollo de la computación cuántica. IBM Quantum es una plataforma de computación avanzada que aprovecha los principios de la mecánica cuántica para resolver problemas complejos que están más allá de las capacidades de las computadoras clásicas. Esta tecnología de vanguardia tiene el potencial de revolucionar las industrias al habilitar nuevos enfoques para la resolución de problemas y la optimización.</p>",
        "<p>Además, el compromiso de IBM con la sostenibilidad y la responsabilidad social corporativa (RSC) refleja su dedicación a tener un impacto positivo en el mundo. La empresa ha implementado diversas iniciativas destinadas a reducir su huella ambiental, promover la diversidad y la inclusión, y apoyar la educación y el desarrollo comunitario. Los esfuerzos de RSC de IBM subrayan su creencia en usar la tecnología como una fuerza para el bien, impulsando un cambio positivo en la sociedad.</p>",
        "<p>En resumen, IBM es un líder global en tecnología, ofreciendo soluciones innovadoras en IA, computación en la nube y hardware empresarial. Con un fuerte énfasis en la investigación y el desarrollo, la empresa continúa impulsando avances tecnológicos que dan forma al futuro de diversas industrias. El compromiso de IBM con la sostenibilidad y la responsabilidad social refuerza aún más su reputación como una organización progresista y consciente socialmente. A través de su suite completa de productos y servicios, IBM empodera a las empresas para lograr sus objetivos y navegar las complejidades de la era digital.</p>"
      ],
      "contribution": [
        "<p>Durante este período, mi responsabilidad principal fue realizar una investigación exhaustiva sobre el uso del mainframe IBM System Z/390s para la virtualización de sistemas. Este proyecto implicaba utilizar Qemu, un emulador de código abierto, para facilitar el proceso de virtualización. El objetivo era habilitar el uso de sistemas remotos creando entornos virtualizados en el mainframe de IBM. Estos sistemas virtuales debían operar bajo el sistema operativo Suse Linux Enterprise Edition, asegurando una plataforma robusta y segura para diversas aplicaciones y servicios.</p>",
        "<p>Mi rol requería una comprensión integral de la arquitectura y capacidades del IBM System Z/390s. Me centré en explorar cómo Qemu podía integrarse eficazmente con el mainframe para lograr una virtualización eficiente. Esto implicaba configurar y optimizar el mainframe para soportar múltiples máquinas virtuales, cada una ejecutando su instancia del Suse Linux Enterprise Edition. El uso de Suse Linux era crítico ya que proporcionaba la estabilidad necesaria y las características de nivel empresarial requeridas para sistemas virtuales de alto rendimiento y fiabilidad.</p>",
        "<p>Además, investigué varios aspectos de la virtualización de sistemas, incluyendo la asignación de recursos, la optimización del rendimiento y las medidas de seguridad. Asegurar que los sistemas virtualizados pudieran operar sin problemas y eficientemente en el mainframe era primordial. Esto implicaba pruebas exhaustivas y ajustes finos de los entornos virtuales para cumplir con las necesidades específicas de los usuarios de sistemas remotos. El proyecto tenía como objetivo aprovechar el poder y la fiabilidad del IBM System Z/390s para proporcionar soluciones virtualizadas escalables y seguras para aplicaciones empresariales.</p>"
      ],
      "links": [],
      "projects": [
        {
          "name": "Desarrollo de sitios web",
          "description": [
            "<p>Implementación de páginas web utilizando CMS como Joomla, Drupal y Moodle.</p>"
          ],
          "links": [],
          "images": [
            "ibm_system_z.jpg",
            "kvm.png",
            "suse.png"
          ],
          "technologies": [
            "Joomla",
            "PHP",
            "JavaScript",
            "MySQL",
            "HTML"
          ]
        }
      ]
    }
  ],
  "educations": {
    "university": [
      {
        "university_name": "UAH",
        "title": "Máster en Inteligencia Artificial en tecnologías de la información y la comunicación",
        "period_time": "Septiembre 2007 - Junio 2009",
        "summary": [
          "Inteligencia artificial y aprendizaje automático. Supervisado, no supervisado y reforzado. Aprendizaje simbólico. Modelos de clasificación y regresión. Optimización de modelos.",
          "Redes profundas. Redes multicapa, retropropagación. Funciones de pérdida. Hiperparámetros y estrategias de aprendizaje.",
          "Redes convolucionales. Reconocimiento de imágenes.",
          "Redes secuenciales y recurrentes. Modelos LSTM.",
          "Técnicas de paralelización y computación en arquitecturas basadas en GPU.",
          "Técnicas de vectorización. Programación con tensorflow y theano.",
          "Aprendizaje automatizado escalable. Frameworks de paralelización en clústeres de computadoras.",
          "Aplicaciones en medicina, finanzas, conducción automática, etc."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      },
      {
        "university_name": "UAH",
        "title": "Ingeniería Técnica en Informática",
        "period_time": "Septiembre 2001 - Junio 2007",
        "summary": [
          "Con honores en: Inteligencia Artificial, Lógica Difusa, Sistemas de Visión Artificial, Física II, Análisis Matemático, Estructura de Datos, Redes."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      }
    ],
    "complementary": [
      {
        "institution": "Fundación Linux",
        "title": "LPIC - 2",
        "period_time": "Septiembre 2015",
        "summary": [
          "Certificación oficial de administración de sistemas Linux que implica la calificación para:",
          "Administración avanzada de sistemas Linux, incluidos los relacionados con el kernel.",
          "Realizar gestión avanzada del almacenamiento de bloques y sistemas de archivos, así como la autenticación avanzada de redes y la seguridad del sistema, incluidos el firewall y la VPN",
          "Instalar y configurar servicios centrales de red (DHCP, DNS, SSH, servidores web, servidores de archivos, correo electrónico, etc.).",
          "Monitorizar asistentes y asesorar a la administración sobre automatización y compras"
        ],
        "images": [
          "linux_foundation.png"
        ],
        "thumbnail": "linux_foundation.png"
      },
      {
        "institution": "Fundación Linux",
        "title": "LPIC - 1",
        "period_time": "Septiembre 2013",
        "summary": [
          "Certificación oficial de administración de sistemas Linux que implica la calificación para:",
          "Instalar un sistema Linux, incluido X11 y configurarlo como un cliente de red.",
          "Trabajar en la línea de comandos.",
          "Gestionar archivos y permisos de acceso, incluidos ACL, así como la seguridad del sistema.",
          "Realizar tareas de mantenimiento sencillas."
        ],
        "images": [
          "linux_foundation.png"
        ],
        "thumbnail": "linux_foundation.png"
      },
      {
        "institution": "Universidad de Alcalá de Henares",
        "title": "Diseño y evaluación de contenidos educativos digitales",
        "period_time": "Septiembre 2007",
        "summary": [
          "Diseño de contenido educativo a través del estándar SCORM."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      },
      {
        "institution": "Universidad de Alcalá de Henares",
        "title": "Curso de visión artificial",
        "period_time": "Septiembre 2007",
        "summary": [
          "Sistemas de visión artificial, matrices de convolución, filtros."
        ],
        "images": [
          "uah.svg"
        ],
        "thumbnail": "uah.svg"
      }
    ],
    "languages": [
      {
        "language": "Español",
        "spoken": "Nativo",
        "writen": "Nativo",
        "read": "Nativo",
        "acreditations": [],
        "thumbnail": "spanish.png"
      },
      {
        "language": "Inglés",
        "spoken": "Fluido",
        "writen": "Fluido",
        "read": "Fluido",
        "acreditations": [],
        "thumbnail": "english.svg"
      },
      {
        "language": "Chino",
        "spoken": "Fluido",
        "writen": "Fluido",
        "read": "Fluido",
        "acreditations": [
          {
            "institution": "Instituto Confucio Madrid",
            "title": "HSK 3",
            "period_time": "Septiembre 2009"
          }
        ],
        "thumbnail": "chinese.png"
      }
    ]
  }
}
